emacs.org
#+PROPERTY: header-args :mkdirp yes
#+PROPERTY: header-args :tangle .emacs.d/init.el

* ChasingLogic's Emacs Configuration
** Global Variables

   These settings are all global variables the either inform or change
   Emacs behavior.
   
*** Auto saves and backups

    Emacs has amazing auto save and backup functionality that has
    saved me many times after such events as an X11 crash or power
    loss. However, it stores all of these files in very inconvenient
    locations when working with version control. These configuration
    options inform Emacs to store these files somewhere "out of the
    way" (=~/.emacs.d/autosaves= and =~/.emacs.d/backups=
    respectively).

    First we ensure that these directories actually exist:

    #+BEGIN_SRC emacs-lisp
      (when (not (file-directory-p "~/.emacs.d/backups"))
        (make-directory "~/.emacs.d/backups")
        (make-directory "~/.emacs.d/autosaves"))
    #+END_SRC

    Next we set =backup-directory-alist=. According it the
    documentation for this variable: "Alist of filename patterns and
    backup directory names.  Each element looks like (REGEXP
    . DIRECTORY).  Backups of files with names matching REGEXP will be
    made in DIRECTORY.". So we set it such that the =REGEXP= is =.*=
    (matches anything) and =DIRECTORY= is our new backup directory.

    #+BEGIN_SRC emacs-lisp
      (setq-default backup-directory-alist `((".*" . "~/.emacs.d/backups")))
    #+END_SRC

    Now we do effectively the same for auto saves. Weirdly the
    configuration is slightly different however. The documentation for
    this variable I found a bit opaque but it essentially does an
    Emacs =replace-regexp= on the filename with the first two
    elements. So that the list is =REGEXP= followed by
    =REPLACEMENT=. See [[Emacs Regular Expressions]] in my Notes section
    for an explanation of the syntax for this. The third element
    specifies that the transformed name should be made unique in
    relation to the other auto saves in this directory.

    #+BEGIN_SRC emacs-lisp
      (setq-default auto-save-file-name-transforms `((".*" "~/.emacs.d/autosaves/\\2" t)))
    #+END_SRC

*** Email and user information

    I use Emacs for my email and other functionality that makes use of
    basic information about me. These variables just define personal
    info that would normally be set on a =$USER= on a Unix system.

    #+BEGIN_SRC emacs-lisp
      (setq-default user-full-name "Mathew Robinson"
                    user-mail-address "mathew@chasinglogic.io"
                    message-signature "- Mathew Robinson @chasinglogic")
    #+END_SRC

*** On MacOS make the command key meta

    Self-explanatory, all of my muscle memory puts meta at the same
    location as the MacOS command key so we make Emacs treat it as
    such instead of as super.

    #+BEGIN_SRC emacs-lisp
      (when (eq system-type 'darwin)
        (setq mac-option-modifier 'alt
              mac-command-modifier 'meta))
    #+END_SRC

*** Basic editor settings

    These settings effect the editing experience of Emacs. Things
    like tabs/spaces etc. are controlled here.

    First we set spaces instead of tabs and set the default
    =tab-width= to 4 spaces.

    #+BEGIN_SRC emacs-lisp
      (setq-default indent-tabs-mode nil
                    tab-width 4)
    #+END_SRC

    By default when Emacs tries to open a symlink that points to a git
    repository it prompts you like "do you really wanna open this
    file". I use symlinks like this a lot so I disable this prompt.

    #+BEGIN_SRC emacs-lisp
      (setq-default vc-follow-symlinks t)
    #+END_SRC

    One of the best features of Emacs is it's ability to integrate
    with programming languages at a syntactic level. It enables you to
    really edit these languages at that level in some
    cases. One of the common tasks that it can automate is commenting
    and uncommenting text in a source file. Unfortunately the default
    function for this =comment-dwim= assumes that if you have no
    region you want to insert a line comment. I rarely if ever use
    line comments and would prefer it to instead comment out the
    current line if no region is selected so I wrote
    =comment-actually-dwim= that does this and overwrite the default
    =comment-dwim= keybinding with my version.

    #+BEGIN_SRC emacs-lisp
      (defun comment-actually-dwim (arg)
        "A simpler and more functional version of `comment-dwim'. It
      simply calls `comment-or-uncomment-region' with the current line
      or the active region.

      The complexity in the original `comment-dwim' comes from trying
      to manage comments at the end of lines. I rarely do on line
      comments so this function better suits my needs."
        (interactive "*P")
        (comment-normalize-vars)
        (if (use-region-p)
            (comment-or-uncomment-region (region-beginning) (region-end) arg)
          (comment-or-uncomment-region (line-beginning-position) (line-end-position))))
    #+END_SRC

    I use =M-x compile= for running all kinds of commands. This
    setting makes it so that the buffer auto scrolls to keep up with
    the output. More like a regular terminal would.

    #+BEGIN_SRC emacs-lisp
      (setq compilation-scroll-output t)
    #+END_SRC

*** Disable new user warnings for commands

    As I discover commands that have the "new user warnings" when I
    use them I disable them here.

    #+BEGIN_SRC emacs-lisp
      (put 'downcase-region 'disabled nil)
    #+END_SRC

** Package initialization

   Before we can set up our configuration for third party packages we
   have to initialize the built-in Emacs package for fetching and
   updating them.

   This snippet loads =package.el= and adds the following repositories
   to Emacs:

   - =elpa=: The GNU default package repository. I actually install very
     little from here since it tends towards being out of date.
   - =melpa=: This is where I get almost everything else. It's a
     rolling up to date Emacs package repository. Maybe someday if I
     experience breakage I'll switch to =melpa-stable= but for years
     now I've never had to roll back a package (except when I was on
     Spacemacs because an update broke Spacemacs code).

   #+BEGIN_SRC emacs-lisp
     (require 'package)

     (setq-default package-archives
                   (list
                    '("elpa" . "http://elpa.gnu.org/packages/")
                    '("melpa" . "http://melpa.org/packages/")))
     (package-initialize)
   #+END_SRC

   Next we setup the amazing =use-package= package. Every package,
   other than =use-package= itself, is installed with
   =use-package=. It's a macro that makes configuration clear,
   concise, and most importantly fast. It makes every single package
   lazy load as you need it (when configured properly), greatly
   improving Emacs startup time.

   First we set a few global configuration options for =use-package=:

   - =use-package-enable-imenu-support=: Allow searching through the
     =init.el= for packages using =imenu=.
   - =use-package-always-ensure=: Almost all of the packages that I
     configure with =use-package= are third party
     packages. =use-package= has a feature called =:ensure= that tells
     =use-package= to install the package on startup if it's not
     installed. Since =use-package= declarations where I don't want
     this behavior are the exception this setting tells =use-package=
     to set =:ensure t= by default.

   #+BEGIN_SRC emacs-lisp
     (setq-default use-package-enable-imenu-support t
                   use-package-always-ensure t)
   #+END_SRC

   Next we actually install =use-package=. We wrap this in a
   =eval-when-compile= call since I byte compile my =init.el= it means
   I don't pay for this installation at startup time. We then use
   =use-package= to install bind-key.

   #+BEGIN_SRC emacs-lisp
     (eval-when-compile
       (package-initialize)
       (when (not (package-installed-p 'use-package))
         (package-refresh-contents)
         (package-install 'use-package))
       (require 'use-package))
   #+END_SRC
*** Quelpa (install packages from git)

    I maintain a few Emacs packages and it's very helpful to be able to
    automatically install and update them. This is what the [[https://framagit.org/steckerhalter/quelpa][Quelpa]]
    package does. It lets you treat git remotes as if they were regular
    package repositories. Additionally we install [[https://framagit.org/steckerhalter/quelpa-use-package][quelpa-use-package]]
    which adds a =:quelpa= keyword argument to =use-package=.

    We also only call quelpa on use-package quelpa if it's not
    installed because I don't nee to update it very often and it slows
    down startup time significantly.

    #+BEGIN_SRC emacs-lisp
      (use-package quelpa
        :init
        (when (not (package-installed-p 'quelpa-use-package))
          (quelpa
           '(quelpa-use-package
             :fetcher git
             :url "https://framagit.org/steckerhalter/quelpa-use-package.git")))
        (require 'quelpa-use-package))
    #+END_SRC
    
** UI / UX settings

   These settings define how I want my Emacs to look from window
   chrome to font and color scheme.

*** Font

    First set the font. I've tried many fonts in my time and I find
    Source Code Pro to be a Pretty Good Font™. Other fonts I like are
    Inconsolata and DejaVu Sans Mono, and one day I may switch back to
    them but getting them on all platforms can be a hassle.

    The only thing fancy about the way this font is getting set is that
    I use two font sizes: one for my Mac because of the retina display
    and one for everything else where I use regular monitors.

    #+BEGIN_SRC emacs-lisp
      (setq-default chasinglogic-font-size "13")
      (when (and (display-graphic-p) (eq system-type 'darwin))
        ;; Retina display requires bigger font IMO.
        (setq chasinglogic-font-size "15"))
      (set-frame-font (format "Source Code Pro %s" chasinglogic-font-size) nil t)
    #+END_SRC

*** Window Chrome

    Emacs by default has lots of window chrome to make it more mouse
    accessible. While I actually use my mouse quite a bit and love
    Emacs mouse integration I really hate big UI elements and I never
    use the mouse for the operations available in this chrome. These
    mode disable lines remove all of this chrome so it's just Me, My
    Buffer, and I.

    #+BEGIN_SRC emacs-lisp
      (tool-bar-mode -1)
      (menu-bar-mode -1)
      (scroll-bar-mode -1)
    #+END_SRC

    On MacOS there's a new feature to have title bars match the window
    they belong to. This makes Emacs do that so the title bar looks
    like it's part of the buffer.

    #+BEGIN_SRC emacs-lisp
      (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
      (add-to-list 'default-frame-alist '(ns-appearance . dark))
    #+END_SRC

*** Color Theme

    I do a lot of bright area coding. My home office is very bright
    and my work office is pretty bright. I've found solarized light to
    be legible and not cause me eye strain. Occasionally I'll do some
    late night Emacs'ing so I keep zenburn around for those times.

    It is kind of annoying that =solarized.el= doesn't work great in
    a terminal but what can you do. I rarely use Emacs there anyway.

    #+BEGIN_SRC emacs-lisp
      (use-package zenburn-theme)
      (use-package solarized-theme
        :config
        (setq-default solarized-high-contrast-mode-line t
                      solarized-distinct-doc-face t
                      solarized-distinct-fringe-background t)
        (load-theme 'solarized-light t))
    #+END_SRC

*** Line numbers in programming modes.

    I enable line numbers using the new Emacs 26
    =display-line-numbers-mode= for all programming major modes.

    #+BEGIN_SRC emacs-lisp
      (defun enable-display-line-numbers-mode ()
        "Enable display-line-numbers-mode"
        (display-line-numbers-mode 1))
      (add-hook 'prog-mode-hook 'enable-display-line-numbers-mode)
    #+END_SRC

*** Automatically maximize Emacs frames when they are created

    This is a custom function I wrote that maximizes the frame it's
    passed. I then hook it into the =after-make-frame-functions= hook
    so any time a frame is created it is maximized.

    #+BEGIN_SRC emacs-lisp
      (defun maximize-gui-frames (frame)
        "Maxmize a the GUI frame FRAME."
        (with-selected-frame frame
          (when (display-graphic-p)
            (set-frame-parameter nil 'fullscreen 'maximized))))
      (add-hook 'after-make-frame-functions 'maximize-gui-frames)
    #+END_SRC

