.emacs.d/init.el
(when (not (file-directory-p "~/.emacs.d/backups"))
  (make-directory "~/.emacs.d/backups")
  (make-directory "~/.emacs.d/autosaves"))

(setq-default backup-directory-alist `((".*" . "~/.emacs.d/backups")))

(setq-default auto-save-file-name-transforms `((".*" "~/.emacs.d/autosaves/\\2" t)))

(setq-default user-full-name "Mathew Robinson"
              user-mail-address "mathew@chasinglogic.io"
              message-signature "- Mathew Robinson @chasinglogic")

(when (eq system-type 'darwin)
  (setq mac-option-modifier 'alt
        mac-command-modifier 'meta))

(setq-default indent-tabs-mode nil
              tab-width 4)

(setq-default vc-follow-symlinks t)

(defun comment-actually-dwim (arg)
  "A simpler and more functional version of `comment-dwim'. It
simply calls `comment-or-uncomment-region' with the current line
or the active region.

The complexity in the original `comment-dwim' comes from trying
to manage comments at the end of lines. I rarely do on line
comments so this function better suits my needs."
  (interactive "*P")
  (comment-normalize-vars)
  (if (use-region-p)
      (comment-or-uncomment-region (region-beginning) (region-end) arg)
    (comment-or-uncomment-region (line-beginning-position) (line-end-position))))

(setq compilation-scroll-output t)

(put 'downcase-region 'disabled nil)

(require 'package)

(setq-default package-archives
              (list
               '("elpa" . "http://elpa.gnu.org/packages/")
               '("melpa" . "http://melpa.org/packages/")))
(package-initialize)

(setq-default use-package-enable-imenu-support t
              use-package-always-ensure t)

(eval-when-compile
  (package-initialize)
  (when (not (package-installed-p 'use-package))
    (package-refresh-contents)
    (package-install 'use-package))
  (require 'use-package))

(use-package quelpa
  :init
  (when (not (package-installed-p 'quelpa-use-package))
    (quelpa
     '(quelpa-use-package
       :fetcher git
       :url "https://framagit.org/steckerhalter/quelpa-use-package.git")))
  (require 'quelpa-use-package))

(setq-default chasinglogic-font-size "13")
(when (and (display-graphic-p) (eq system-type 'darwin))
  ;; Retina display requires bigger font IMO.
  (setq chasinglogic-font-size "15"))
(set-frame-font (format "Source Code Pro %s" chasinglogic-font-size) nil t)

(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)

(add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
(add-to-list 'default-frame-alist '(ns-appearance . dark))

(use-package zenburn-theme)
(use-package solarized-theme
  :config
  (setq-default solarized-high-contrast-mode-line t
                solarized-distinct-doc-face t
                solarized-distinct-fringe-background t)
  (load-theme 'solarized-light t))

(defun enable-display-line-numbers-mode ()
  "Enable display-line-numbers-mode"
  (display-line-numbers-mode 1))
(add-hook 'prog-mode-hook 'enable-display-line-numbers-mode)

(defun maximize-gui-frames (frame)
  "Maxmize a the GUI frame FRAME."
  (with-selected-frame frame
    (when (display-graphic-p)
      (set-frame-parameter nil 'fullscreen 'maximized))))
(add-hook 'after-make-frame-functions 'maximize-gui-frames)

(require 'dired-x)
