emacs.org
** Built-in Emacs Modes

   These modes are shipped by default with Emacs but either not
   enabled by default or require some setup to use. I find them all
   useful and I put them in =use-package= definitions for consistency.
   
*** Dired

    I use dired as my primary file manager for anything that isn't
    multimedia content (videos, photos, music). I really love it and
    some kinds of file operations are simply not possible without it.

    First we require =dired-x=. Dired-X provides many extra features
    to Dired that take it from nice to unparalleled. See [[info:dired-x#Features][Dired-X
    Features]] for a full list with more info.

    #+BEGIN_SRC emacs-lisp
      (require 'dired-x)
    #+END_SRC

    Now we set the variable =dired-dwim-target= to =t=. This makes it
    such that when operating on files in Dired the target of the
    operation will automatically suggest other Dired buffers as the
    target preferring buffers that are visible. It's super handy.

    #+BEGIN_SRC emacs-lisp
      (setq-default dired-dwim-target t)
    #+END_SRC

*** Abbrev Mode

    Abbrev mode is a simple but magical minor mode. I make some
    spelling mistakes all the time. At this point some of them have
    become muscle memory and so while I know the spelling is wrong I
    don't know if I'll ever be able to change them. This is where
    Abbrev mode comes in. I register abbreviations on a major mode or
    global basis and =abbrev-mode= will automatically expand them to
    the correction whenever I type them.

    #+BEGIN_SRC emacs-lisp
      (abbrev-mode 1)
    #+END_SRC

    The common key bindings I always forget for this are:

    | Key chord | Description                             |
    |-----------+-----------------------------------------|
    | C-x a l   | Adds mode-specific abbreviation         |
    | C-x a g   | Adds global abbreviation                |
    | C-x a i g | Adds global inverse abbreviation        |
    | C-x a i l | Adds mode-specific inverse abbreviation |

    For the first two bindings you type the expanded abbreviation then
    position the point after the text. You then press the key chord
    and enter what the abbreviated form is. For the latter two
    bindings inverse means the abbreviation is before the point and
    you enter the text to expand to.
    
*** Spell Checking (Flyspell)

    While Abbrev mode will solve my habitual spelling errors for me
    it's still nice to have spell check on so I can catch new spelling
    errors. This is baked into Emacs and requires the =aspell= (or
    =ispell=) program to be installed. I enable =flyspell-mode= for
    all text buffers and use a subsequent hook for programming modes
    to disable it and instead enable the programming variant that
    spell checks comments instead of code.

    #+BEGIN_SRC emacs-lisp
      (defun chasinglogic-enable-flyspell ()
        "Enable spell checking."
        (flyspell-mode 1))

      (defun chasinglogic-enable-flyspell-prog ()
        "Enable spell checking."
        (flyspell-mode -1)
        (flyspell-prog-mode))

      (add-hook 'text-mode-hook 'chasinglogic-enable-flyspell)
      (add-hook 'prog-mode-hook 'chasinglogic-enable-flyspell-prog)
    #+END_SRC

*** Ediff

    Ediff is a handy tool I don't use often enough. However I really
    hate the default layout. This makes Ediff less eggregious about
    upsetting my window manager when I load it.

    #+BEGIN_SRC emacs-lisp
      (setq-default ediff-window-setup-function 'ediff-setup-windows-plain)
    #+END_SRC

*** Automatically Do important programming stuff

    Emacs has a series of modes that I call the "electric modes", as
    they all start with =electric-=. All of these modes perform
    important editing functions automatically.

    Electric indent mode on-the-fly reindents your code as you
    type. It checks for newlines and other common chars that are
    configured via the variable =electric-indent-chars=. This mode is
    invaluable and saves me a lot of formatting time.

    #+BEGIN_SRC emacs-lisp
      (electric-indent-mode 1)
    #+END_SRC

    Electric layout mode automatically inserts newlines around some
    characters. The variable =electric-layout-rules= defines when and
    how to insert newlines. The short of it is for many modes this
    auto formats code.

    #+BEGIN_SRC emacs-lisp
      (electric-layout-mode 1)
    #+END_SRC

    Electric pair mode automatically pairs common programming
    operators: =(=, ={=, ="=, ='=, etc. I find this behavior annoying
    in prose modes so I use a custom hook to only enable it for
    programming modes.

    #+BEGIN_SRC emacs-lisp
      (defun enable-electric-pair-local-mode ()
        "Enable eletric pair mode locally."
        (electric-pair-local-mode 1))
      (add-hook 'prog-mode-hook 'enable-electric-pair-local-mode)
    #+END_SRC

*** Show Paren Mode

    I'm just going to steal the description of this straight from the
    documentation: Toggle visualization of matching parens (Show Paren
    mode).

    #+BEGIN_SRC emacs-lisp
      (show-paren-mode 1)
    #+END_SRC

** My personal utility functions and commands

   I have an ever growing list of personal utility functions. Some of
   these add features that should be in Emacs by default, some of them
   are personal workflow improvements.
*** Delete current buffer and file

    I will never understand why this isn't baked into Emacs. I've
    stolen this from Spacemacs who stole it from Magnars. Now you can
    steal it from me. In short it will delete the buffer and the file
    it's visiting.

    #+BEGIN_SRC emacs-lisp
      ;; from spacemacs-core
      ;; from magnars
      (defun chasinglogic-delete-current-buffer-file ()
        "Remove file connected to current buffer and kill the related buffer."
        (interactive)
        (let ((filename (buffer-file-name))
              (buffer (current-buffer))
              (name (buffer-name)))
          (if (not (and filename (file-exists-p filename)))
              (ido-kill-buffer)
            (when (yes-or-no-p "Are you sure you want to delete this file? ")
              (delete-file filename t)
              (kill-buffer buffer)
              (when (projectile-project-p)
                (call-interactively #'projectile-invalidate-cache))
              (message "File '%s' successfully removed" filename)))))
    #+END_SRC
    
*** Indent the buffer

    This function uses Emacs built in indent facilities to indent the
    entire buffer. It doesn't work so great on languages where
    whitespace has semantic meaning, like Python, but it is a godsend
    for structured languages that are commonly poorly formatted, like
    HTML.

    #+BEGIN_SRC emacs-lisp
      (defun chasinglogic-indent-buffer ()
        "Indent the entire buffer."
        (interactive)
        (indent-region-line-by-line (point-min) (point-max)))
    #+END_SRC

*** Finding org files

    I keep all of my org files in =org-directory= and some of them are
    encrypted. This macro lets me easily define functions for quickly
    finding them. It's a macro because [[https://www.jamesporter.me/2013/06/14/emacs-lisp-closures-exposed.html][Emacs has crazy scoping rules]]
    that make returning lambdas from functions difficult.

    #+BEGIN_SRC emacs-lisp
      (defmacro chasinglogic-find-org-file (name)
        "Create a function to find the org file NAME."
        `(defun ,(intern (format "chasinglogic-find-org-file-%s" name)) ()
           (interactive)
           (let ((file-name (expand-file-name ,(format "%s.org" name) org-directory)))
             (find-file (if (file-exists-p (concat file-name ".gpg"))
                            (concat file-name ".gpg")
                          file-name)))))
      (chasinglogic-find-org-file notes)
      (chasinglogic-find-org-file ideas)
      (chasinglogic-find-org-file todo)
    #+END_SRC

*** Rename file and buffer

    Similar to [[Delete file and buffer]] I'm not sure why this isn't
    built into Emacs. This does a rename using =default-directory= and
    relative paths to the file do work. I took this from
    [[http://steve.yegge.googlepages.com/my-dot-emacs-file][Steve Yegge's dot Emacs]].

    #+BEGIN_SRC emacs-lisp
      (defun chasinglogic-rename-file-and-buffer (new-name)
        "Renames both current buffer and file it's visiting to NEW-NAME."
        (interactive "sNew name: ")
        (let ((name (buffer-name))
              (filename (buffer-file-name)))
          (if (not filename)
              (message "Buffer '%s' is not visiting a file!" name)
            (if (get-buffer new-name)
                (message "A buffer named '%s' already exists!" new-name)
              (progn
                (rename-file filename new-name 1)
                (rename-buffer new-name)
                (set-visited-file-name new-name)
                (set-buffer-modified-p nil))))))
    #+END_SRC

*** Projector => Projectile integration

    I maintain (what I think) is a pretty cool tool called [[https://github.com/chasinglogic/projector][Projector]]
    and this "integrates" it with projectile. Simply put it seeds
    Projectile's known project list with the list of projects that
    Projector knows about. It's really nice when on a new machine that
    has all my repositories but since I haven't visited them I can't
    quickly switch to them.

    #+BEGIN_SRC emacs-lisp
      (defun chasinglogic-add-projector-projects-to-projectile ()
        "Add projector projects to projectile."
        (interactive)
        (setq
         projectile-known-projects
         (delete ""
                 (split-string
                  (shell-command-to-string "projector list") "\n"))))
    #+END_SRC

*** Open the shell with a good default buffer name

    This function opens a shell with a buffer name that indicates what
    project it was opened in. If you run it again in that project it
    will instead just switch to the buffer.

    #+BEGIN_SRC emacs-lisp
      (defun chasinglogic-shell ()
        "Open my shell in 'ansi-term'."
        (interactive)
        (let* ((project-name (if (projectile-project-name)
                                 (projectile-project-name)
                               "main"))
               (shell-buf-name (concat project-name "-shell"))
               (shell-buf-asterisks (concat "*" shell-buf-name "*")))
          (if (get-buffer shell-buf-asterisks)
              (switch-to-buffer shell-buf-asterisks)
            (ansi-term (executable-find "bash") shell-buf-name))))
    #+END_SRC

