.emacs.d/init.el

(setq-default dired-dwim-target t)

(abbrev-mode 1)

(defun chasinglogic-enable-flyspell ()
  "Enable spell checking."
  (flyspell-mode 1))

(defun chasinglogic-enable-flyspell-prog ()
  "Enable spell checking."
  (flyspell-mode -1)
  (flyspell-prog-mode))

(add-hook 'text-mode-hook 'chasinglogic-enable-flyspell)
(add-hook 'prog-mode-hook 'chasinglogic-enable-flyspell-prog)

(setq-default ediff-window-setup-function 'ediff-setup-windows-plain)

(electric-indent-mode 1)

(electric-layout-mode 1)

(defun enable-electric-pair-local-mode ()
  "Enable eletric pair mode locally."
  (electric-pair-local-mode 1))
(add-hook 'prog-mode-hook 'enable-electric-pair-local-mode)

(show-paren-mode 1)

;; from spacemacs-core
;; from magnars
(defun chasinglogic-delete-current-buffer-file ()
  "Remove file connected to current buffer and kill the related buffer."
  (interactive)
  (let ((filename (buffer-file-name))
        (buffer (current-buffer))
        (name (buffer-name)))
    (if (not (and filename (file-exists-p filename)))
        (ido-kill-buffer)
      (when (yes-or-no-p "Are you sure you want to delete this file? ")
        (delete-file filename t)
        (kill-buffer buffer)
        (when (projectile-project-p)
          (call-interactively #'projectile-invalidate-cache))
        (message "File '%s' successfully removed" filename)))))

(defun chasinglogic-indent-buffer ()
  "Indent the entire buffer."
  (interactive)
  (indent-region-line-by-line (point-min) (point-max)))

(defmacro chasinglogic-find-org-file (name)
  "Create a function to find the org file NAME."
  `(defun ,(intern (format "chasinglogic-find-org-file-%s" name)) ()
     (interactive)
     (let ((file-name (expand-file-name ,(format "%s.org" name) org-directory)))
       (find-file (if (file-exists-p (concat file-name ".gpg"))
                      (concat file-name ".gpg")
                    file-name)))))
(chasinglogic-find-org-file notes)
(chasinglogic-find-org-file ideas)
(chasinglogic-find-org-file todo)

(defun chasinglogic-rename-file-and-buffer (new-name)
  "Renames both current buffer and file it's visiting to NEW-NAME."
  (interactive "sNew name: ")
  (let ((name (buffer-name))
        (filename (buffer-file-name)))
    (if (not filename)
        (message "Buffer '%s' is not visiting a file!" name)
      (if (get-buffer new-name)
          (message "A buffer named '%s' already exists!" new-name)
        (progn
          (rename-file filename new-name 1)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modified-p nil))))))

(defun chasinglogic-add-projector-projects-to-projectile ()
  "Add projector projects to projectile."
  (interactive)
  (setq
   projectile-known-projects
   (delete ""
           (split-string
            (shell-command-to-string "projector list") "\n"))))

(defun chasinglogic-shell ()
  "Open my shell in 'ansi-term'."
  (interactive)
  (let* ((project-name (if (projectile-project-name)
                           (projectile-project-name)
                         "main"))
         (shell-buf-name (concat project-name "-shell"))
         (shell-buf-asterisks (concat "*" shell-buf-name "*")))
    (if (get-buffer shell-buf-asterisks)
        (switch-to-buffer shell-buf-asterisks)
      (ansi-term (executable-find "bash") shell-buf-name))))
