emacs.org
*** GDB/LLDB Debugging

    I maintain a developer toolchain that means I have to frequently
    interact with GDB *and* LLDB. Since LLDB does not have Emacs
    integration this function allow me to easily get breakpoints for
    wherever I am.

    It checks for the =projectile-project-root= and if found will make
    the filename relative to this directory. Otherwise the full path
    of the =buffer-file-name= will be used. It grabs the line number
    the point is currently at then simply concatenates the generated
    filename, a colon, and the line number. When called interactively
    it will add it to the kill ring effectively "copying" the
    breakpoint for easy pasting.

    #+BEGIN_SRC emacs-lisp
      (defun chasinglogic-copy-breakpoint-for-here (&optional copy)
        "Return a filename:linenumber pair for point for use with LLDB/GDB.

      If COPY is provided copy the value to kill ring instead of returning."
        (interactive (list t))
        (let* ((line-number (format "%d" (line-number-at-pos)))
               (file-name (if (projectile-project-root)
                              (file-relative-name (buffer-file-name) (projectile-project-root))
                            (file-name-nondirectory (buffer-file-name))))
               (breakpoint (concat file-name ":" line-number)))
          (if copy
              (progn
                (kill-new breakpoint)
                (message "%s" breakpoint))
            breakpoint)))
    #+END_SRC

*** Edit current buffer with sudo

    The title here is self explanatory. It uses Emacs [[https://www.emacswiki.org/emacs/TrampMode][TRAMP Mode]] to
    open the file as root on localhost. It does not require SSH and
    instead uses a special TRAMP protocol that just calls =sudo= to
    make the user change.

    #+BEGIN_SRC emacs-lisp
      (defun sudo ()
        "Use TRAMP to `sudo' the current buffer"
        (interactive)
        (when buffer-file-name
          (find-alternate-file
           (concat "/sudo:root@localhost:" buffer-file-name))))
    #+END_SRC

** Global Keybindings

   These are my global keybindings that bind my custom commands or
   rebind Emacs defaults. I also document what the default binding was
   if I overwrite one so I can remember if I ever want or need to go
   back during a live session.

   #+BEGIN_SRC emacs-lisp
     (bind-key "C-x '"   'chasinglogic-shell)
     (bind-key "C-c j b" 'chasinglogic-copy-breakpoint-for-here)
     (bind-key "C-c j =" 'chasinglogic-indent-buffer)
     (bind-key "C-c f r" 'chasinglogic-rename-file-and-buffer)
     (bind-key "C-c f D" 'chasinglogic-delete-current-buffer-file)

     ;; Reverse the M-<> keybinds with M-,. because I move to the
     ;; beginning and end of buffers far more often than I
     ;; xref-pop-marker-stack
     (bind-key "M-<" 'xref-pop-marker-stack)
     (bind-key "M->" 'xref-find-definitions)
     (bind-key "M-," 'beginning-of-buffer)
     (bind-key "M-." 'end-of-buffer)

     ;; Bind M-[] to paragraph movement. Normally this is M-{} which
     ;; still is bound. This is more convenient and the M-[] keys were
     ;; bound to nighting anyway
     (bind-key "M-[" 'backward-paragraph)
     (bind-key "M-]" 'forward-paragraph)

     (bind-key "C-x C-b" 'ibuffer)

     (bind-key "M-;" 'comment-actually-dwim)
   #+END_SRC

** Third Party Packages

   These are all of the third party packages I install and use with
   Emacs. I simply group them under this heading for a more logical
   outline.

*** Evergreen CI integration

    This is one of my personal packages. At MongoDB we run our in house
    CI system and this package integrates it into Emacs. We don't
    maintain an in-house ELPA repository so I recommend, and myself do,
    installing it with Quelpa.

    #+BEGIN_SRC emacs-lisp
      (use-package evergreen
        :quelpa (evergreen :repo "evergreen-ci/evergreen.el" :fetcher github)
        :commands (evergreen-patch evergreen-list-spawn-hosts)
        :config
        (setq-default evergreen-generate-description t
                      evergreen-finalize-when-patching t
                      evergreen-browse-when-patching t
                      evergreen-default-project "mongodb-mongo-master"
                      evergreen-assume-yes t))
    #+END_SRC

*** Emacs environment variables (exec-path-from-shell)

    I use the =exec-path-from-shell= package to keep my shell and Emacs
    environment variables in sync. I pay a little in startup time for
    this but maintaining two copies of environment variables is way
    worth it.

    #+BEGIN_SRC emacs-lisp
      (use-package exec-path-from-shell
        :config
        (exec-path-from-shell-initialize))
    #+END_SRC

*** Diminish

    Diminish is a neat package that lets me easily hide minor modes
    from the mode line. It also has a =use-package= keyword that lets
    me do this for third party packages easily. Here we ensure that
    it's available and diminish some common minor modes:

    #+BEGIN_SRC emacs-lisp
      (use-package diminish
        :init
        (diminish 'abbrev-mode)
        (diminish 'eldoc-mode)
        (diminish 'undo-tree-mode))
    #+END_SRC

*** Which Key

    Which key is possibly the best package ever invented, except for
    maybe helm. When pressing a key chord it will show you all possible
    bindings and prefixes so you can interactively explore key bindings
    as you type them. It's nothing short of amazing and a great
    discovery tool. No real configuration is needed except that I do
    diminish it since I always have it on globally.

    #+BEGIN_SRC emacs-lisp
      (use-package which-key
        :diminish ""
        :init
        (which-key-mode))
    #+END_SRC

*** Expand Region

    Expand region takes the idea of, what I consider, one of the best
    key bindings in Emacs =M-h= (=mark-paragraph=) and makes it work
    incrementally with semantic units. It's beautiful and useful. For
    consistency I bind it to =C-M-h=.

    #+BEGIN_SRC emacs-lisp
      (use-package expand-region
        :bind ("C-M-h" . expand-region))
    #+END_SRC

*** Avy

    The legendary =abo-abo= wrote a great package called Avy. I can
    only compare it to EasyMotion for Vim but it's actually much
    better IMO. It has many "jumping" commands for going to words,
    subwords, characters, lines etc. Here I only bind a few of the
    most useful ones to me.

    #+BEGIN_SRC emacs-lisp
      (use-package avy
        :bind
        (("M-j"     . 'avy-goto-word-1)
         ("C-c j c" . 'avy-goto-char)
         ("C-c j j" . 'avy-goto-word-1)
         ("C-c j l" . 'avy-goto-line)
         ("C-c j h" . 'avy-goto-heading)))
    #+END_SRC

*** Ace Window

    One of the hardest parts coming to Emacs from Vim was learning
    window management. The default keybinding =C-x o= felt cumbersome
    to press not to mention use. Luckily there is a package (again
    from =abo-abo=) that solves this problem. Ace Window will
    highlight windows with a number and let you jump to them by
    pressing the corresponding number. It's also smart and when there
    are only two windows will simply cycle between them without
    prompting. I bind it to =M-o= as the original command bound to
    that key I never use and I prefer meta bindings for commonly
    pressed commands.

    #+BEGIN_SRC emacs-lisp
      (use-package ace-window
        :bind ("M-o" . ace-window))
    #+END_SRC

*** Hydra

    Hydra is a weird package. You define a hydra and when it's
    activated you can press any keys in the hydra to use the command
    bound to that "hydra head". When you press any key that doesn't
    correspond to a head the hydra ends and you go back to a regular
    "Emacs state". I use this for when I need to string commands
    together frequently such as when searching / moving through a code
    base or doing complex window management. It saves having hold
    control or meta forever.

    First install the package.

    #+BEGIN_SRC emacs-lisp
      (use-package hydra
        :config
    #+END_SRC

    Now we define our hydras.
    
**** Movement Hydra

     I use this hydra for when I'm reading a code base. It lets me
     string together Emacs movement and search commands.

     #+BEGIN_SRC emacs-lisp
       (defhydra chasinglogic-movement-hydra (global-map "C-x m")
         ("q" nil "quit")
         ("n" next-line "next line")
         ("p" previous-line "previous line")
         ("b" backward-char "backward char")
         ("f" forward-char "forward char")
         ("i" isearch-forward "isearch forward")
         ("s" helm-swoop "swoop search")
         ("r" helm-rg "ripgrep search")
         ("R" helm-projectile-rg "project level ripgrep search")
         ("w" forward-word "forward word")
         ("W" backward-word "backward word")
         ("v" scroll-up-command "scroll down")
         ("V" scroll-down-command "scroll up")
         ("l" recenter-top-bottom "recenter")
         ("h" org-next-visible-heading "next heading")
         ("H" org-previous-visible-heading "previous heading")
         ("[" backward-paragraph "backward paragraph")
         ("]" forward-paragraph "forward paragraph"))
     #+END_SRC


**** Window Management Hydra

     I use this when I'm setting up a specific window configuration or
     flipping between window configurations with registers.

     #+BEGIN_SRC emacs-lisp
       (defhydra chasinglogic-window-hydra (global-map "C-c j w")
         ("q" nil "quit")
         ("j" ace-window "switch windows")
         ("r" window-configuration-to-register "save window configuration to register")
         ("l" jump-to-register "load window configuration from register")
         ("=" balance-windows "balance windows")
         ("d" delete-window "delete this window")
         ("o" delete-other-windows "delete other windows")
         ("v" split-window-right "split window to right")
         ("s" split-window-below "split window below"))
     #+END_SRC

**** End package declaration

     This just closes the Hydra =use-package= config section.

     #+BEGIN_SRC emacs-lisp
       )
     #+END_SRC

*** Paredit

    When talking about editing languages at a syntactic level one
    can't help but think of paredit. It's simply the best way to write
    lisp code. It adds two important to remember key bindings:

    | Key Bindings      | Descrpition              |
    |-------------------+--------------------------|
    | C-M-<Right Arrow> | Barf current expression  |
    | C-M-<Left Arrow>  | Slurp current expression |

    Additionally I overwrite one mapping so that Paredit uses my
    preferred =comment-actually-dwim= function instead of it's own
    that mostly mimics the Emacs default.

    #+BEGIN_SRC emacs-lisp
      (use-package paredit
        :bind (:map paredit-mode-map
                    ;; I do not like any version of the original
                    ;; `comment-dwim' and paredit has it's own special
                    ;; version that I find more confusing. So overwrite it's
                    ;; mapping with my `comment-actually-dwim' function.
                    ("M-;" . comment-actually-dwim))
        :hook '(emacs-lisp-mode . paredit-mode))
    #+END_SRC
