.emacs.d/init.el

(defun chasinglogic-copy-breakpoint-for-here (&optional copy)
  "Return a filename:linenumber pair for point for use with LLDB/GDB.

If COPY is provided copy the value to kill ring instead of returning."
  (interactive (list t))
  (let* ((line-number (format "%d" (line-number-at-pos)))
         (file-name (if (projectile-project-root)
                        (file-relative-name (buffer-file-name) (projectile-project-root))
                      (file-name-nondirectory (buffer-file-name))))
         (breakpoint (concat file-name ":" line-number)))
    (if copy
        (progn
          (kill-new breakpoint)
          (message "%s" breakpoint))
      breakpoint)))

(defun sudo ()
  "Use TRAMP to `sudo' the current buffer"
  (interactive)
  (when buffer-file-name
    (find-alternate-file
     (concat "/sudo:root@localhost:" buffer-file-name))))

(bind-key "C-x '"   'chasinglogic-shell)
(bind-key "C-c j b" 'chasinglogic-copy-breakpoint-for-here)
(bind-key "C-c j =" 'chasinglogic-indent-buffer)
(bind-key "C-c f r" 'chasinglogic-rename-file-and-buffer)
(bind-key "C-c f D" 'chasinglogic-delete-current-buffer-file)

;; Reverse the M-<> keybinds with M-,. because I move to the
;; beginning and end of buffers far more often than I
;; xref-pop-marker-stack
(bind-key "M-<" 'xref-pop-marker-stack)
(bind-key "M->" 'xref-find-definitions)
(bind-key "M-," 'beginning-of-buffer)
(bind-key "M-." 'end-of-buffer)

;; Bind M-[] to paragraph movement. Normally this is M-{} which
;; still is bound. This is more convenient and the M-[] keys were
;; bound to nighting anyway
(bind-key "M-[" 'backward-paragraph)
(bind-key "M-]" 'forward-paragraph)

(bind-key "C-x C-b" 'ibuffer)

(bind-key "M-;" 'comment-actually-dwim)

(use-package evergreen
  :quelpa (evergreen :repo "evergreen-ci/evergreen.el" :fetcher github)
  :commands (evergreen-patch evergreen-list-spawn-hosts)
  :config
  (setq-default evergreen-generate-description t
                evergreen-finalize-when-patching t
                evergreen-browse-when-patching t
                evergreen-default-project "mongodb-mongo-master"
                evergreen-assume-yes t))

(use-package exec-path-from-shell
  :config
  (exec-path-from-shell-initialize))

(use-package diminish
  :init
  (diminish 'abbrev-mode)
  (diminish 'eldoc-mode)
  (diminish 'undo-tree-mode))

(use-package which-key
  :diminish ""
  :init
  (which-key-mode))

(use-package expand-region
  :bind ("C-M-h" . expand-region))

(use-package avy
  :bind
  (("M-j"     . 'avy-goto-word-1)
   ("C-c j c" . 'avy-goto-char)
   ("C-c j j" . 'avy-goto-word-1)
   ("C-c j l" . 'avy-goto-line)
   ("C-c j h" . 'avy-goto-heading)))

(use-package ace-window
  :bind ("M-o" . ace-window))

(use-package hydra
  :config

(defhydra chasinglogic-movement-hydra (global-map "C-x m")
  ("q" nil "quit")
  ("n" next-line "next line")
  ("p" previous-line "previous line")
  ("b" backward-char "backward char")
  ("f" forward-char "forward char")
  ("i" isearch-forward "isearch forward")
  ("s" helm-swoop "swoop search")
  ("r" helm-rg "ripgrep search")
  ("R" helm-projectile-rg "project level ripgrep search")
  ("w" forward-word "forward word")
  ("W" backward-word "backward word")
  ("v" scroll-up-command "scroll down")
  ("V" scroll-down-command "scroll up")
  ("l" recenter-top-bottom "recenter")
  ("h" org-next-visible-heading "next heading")
  ("H" org-previous-visible-heading "previous heading")
  ("[" backward-paragraph "backward paragraph")
  ("]" forward-paragraph "forward paragraph"))

(defhydra chasinglogic-window-hydra (global-map "C-c j w")
  ("q" nil "quit")
  ("j" ace-window "switch windows")
  ("r" window-configuration-to-register "save window configuration to register")
  ("l" jump-to-register "load window configuration from register")
  ("=" balance-windows "balance windows")
  ("d" delete-window "delete this window")
  ("o" delete-other-windows "delete other windows")
  ("v" split-window-right "split window to right")
  ("s" split-window-below "split window below"))

)

(use-package paredit
  :bind (:map paredit-mode-map
              ;; I do not like any version of the original
              ;; `comment-dwim' and paredit has it's own special
              ;; version that I find more confusing. So overwrite it's
              ;; mapping with my `comment-actually-dwim' function.
              ("M-;" . comment-actually-dwim))
  :hook '(emacs-lisp-mode . paredit-mode))

(use-package helm
  :bind (("M-x"      . helm-M-x)
         ("C-x b"    . helm-mini)
