emacs.org
*** Helm

    Helm is my current fuzzy searching framework. I've switched
    between Helm and Ivy often enough that it's almost worth having
    both. At this point and time however I think I'll stick with
    helm. It mostly behaves how I want, it's fast enough, and most
    importantly it has more third party packages that I use. I think
    when something like =helm-org-rifle= and =helm-mu= are available
    for Ivy I might switch back but for now I can't live without these
    and I'd rather have one way of doing fuzzy completion.

    This =use-package= declaration for Helm does a few interesting
    things. First it binds common key chords to their improved helm
    equivalents. Next it defines two variables that when combined make
    helm display at the bottom of the frame full width. Kind of like
    the minibuffer but not. I prefer this positioning but I have no
    idea how these variables accomplish it I [[https://github.com/emacs-helm/helm/issues/2039#issuecomment-390103697][stole this configuration
    from this random comment on the Helm issue tracker]]. Finally
    enables the helm minor mode that just makes helm kind of work with
    everything even if it doesn't have an explicit helm integration.

    #+BEGIN_SRC emacs-lisp
      (use-package helm
        :bind (("M-x"      . helm-M-x)
               ("C-x b"    . helm-mini)
               ("M-y"      . helm-show-kill-ring)
               ("M-i"      . helm-imenu)
               ("M-I"      . helm-imenu-in-all-buffers)
               ("C-x r b"  . helm-bookmarks)
               ("C-x C-f"  . helm-find-files))
        :config
        (setq helm-always-two-windows nil)
        (setq helm-default-display-buffer-functions '(display-buffer-in-side-window))
        (helm-mode 1))
    #+END_SRC

**** Helm Swoop

     There were two main killer features, to me, of Ivy. One of them
     was Swiper, the enhanced incremental search. This package
     =helm-swoop= kind of fills that gap. It's less nice than swiper
     (it breaks my helm window configuration rules) but it gets the job
     done. I bind it to =C-M-s= globally.

     #+BEGIN_SRC emacs-lisp
       (use-package helm-swoop
         :after helm
         :bind ("C-M-s" . helm-swoop))
     #+END_SRC
     
**** Helm select frames

**** Helm mu

     This is my favorite thing about Helm. I use the excellent mu4e
     package and mu tool to manage my Email locally. This lets me
     incrementally search my email using the mu query language and
     interact with the results.

     #+BEGIN_SRC emacs-lisp
       (use-package helm-mu
         :after (helm mu4e)
         :hook (mu4e-main-mode-hook .
                                    (lambda ()
                                      (bind-key "s" helm-mu mu4e-main-mode-map)
                                      (bind-key "s" helm-mu mu4e-headers-mode-map)
                                      (bind-key "s" helm-mu mu4e-view-mode-map)))
         :bind (("C-c s m" . helm-mu)
                ("C-c s c" . helm-mu-contacts)))
     #+END_SRC

**** Helm Projectile

     Projectile will use helm for completion as I've set
     =projectile-completion-system= to ='helm=. However this package
     provides some more feature rich actions in those Helm buffers and
     so we rebind the =projectile-command-map= keys to these enhanced
     versions. Additionally I use =helm-rg= with =helm-projectile-rg=
     to search my projects. I use ripgrep both in and out of Emacs so
     I can keep the experience consistent and fast.

     #+BEGIN_SRC emacs-lisp
       (use-package helm-projectile
         :after (helm projectile)
         :bind (:map projectile-command-map
                     ("h" . helm-projectile-find-other-file)
                     ("f" . helm-projectile-find-file)
                     ("p" . helm-projectile-switch-project)
                     ("s" . helm-projectile-rg)))
       (use-package helm-rg :after 'helm-projectile)
     #+END_SRC

**** Helm Org

     This package adds helm sources for org mode buffers. You can
     search through in buffer headers, capture templates, and more. I
     only bind the most commonly used commands however.

     #+BEGIN_SRC emacs-lisp
       (use-package helm-org
         :after (helm org)
         :bind (("C-c s o c" . helm-org-capture-templates)
                ("C-c s o h" . helm-org-in-buffer-headings)
                ("C-c o o"   . helm-org-in-buffer-headings)))
     #+END_SRC

**** Helm Org Rifle

     While =helm-org= integrates Helm with org mode buffer
     editing. =helm-org-rifle= is something all together more
     powerful. It does entry based searching for terms across all open
     Org mode buffers. It can do the same for files, directories, and
     the agenda. It's exteremely powerful and I don't use it
     enough. But when I do need it, for instance trying to find a
     note, it's irreplaceable.

     #+BEGIN_SRC emacs-lisp
       (use-package helm-org-rifle
         :after (helm org)
         :bind  ("C-c s o r" . helm-org-rifle))
     #+END_SRC

**** TODO Helm pass

     I've been considering a switch back to Password store. If I do
     =helm-pass= would give me a great way to find and copy passwords.

*** Company Mode

    Company stands for COMPlete ANYthing and it does. I enable it
    globally and diminish it since it is always on. I only set
    =company-dabbrev-downcase= to nil. This ignores casing when
    providing suggestions taken from inside the current buffer.

    #+BEGIN_SRC emacs-lisp
      (use-package company
        :diminish ""
        :config
        (setq-default company-dabbrev-downcase nil)
        (global-company-mode))
    #+END_SRC

*** LSP Mode

    LSP mode attempts to make Emacs as featureful as VSCode when it
    comes to "IDE-esque" features. I would say it gets almost all the
    way there. However I disable a lot of these features for
    performance or visual disruption reasons. Even with most of these
    UI elements disabled it provies the best completion and linting of
    any package in the Emacs ecosystem. The best part is that it's a
    single package so I don't have to maintain a milling =company-*=
    and =flycheck-*= packages. It consists of two packages =lsp-mode=
    itself that provides the Language Server interaction and =lsp-ui=
    that provides the bulk of interactive features for the Language
    Server. I only install =lsp-ui= for the Flycheck integration.

    #+BEGIN_SRC emacs-lisp
      (use-package lsp-mode
        :init (setq-default lsp-auto-guess-root t
                            lsp-prefer-flymake nil)
        :commands 'lsp)

      (use-package lsp-ui
        :hook 'lsp-mode
        :init
        (setq-default
         lsp-ui-doc-enable nil
         lsp-ui-peek-enable nil
         lsp-ui-sideline-enable nil
         lsp-ui-imenu-enable nil
         lsp-ui-flycheck-enable t))
    #+END_SRC
    
**** LSP powered auto completion

     We need one more package to integrate LSP mode with my completion
     framework Company, the cleverly named, =company-lsp=. All that we
     need to do is add it to company backends.

     #+BEGIN_SRC emacs-lisp
       (use-package company-lsp
         :config (push 'company-lsp company-backends)
         :after (lsp-mode company))
     #+END_SRC

     
**** CCLS support

     I've found CCLS to be the best and most available language server
     for C / C++. For LSP to use it however it requires the additional
     third party package =ccls=. So here we install it and hook in
     enabling =lsp= for all C / C++ modes.

     #+BEGIN_SRC emacs-lisp
       (use-package ccls
         :hook ((c-mode c++-mode objc-mode) .
                (lambda () (require 'ccls) (lsp))))
     #+END_SRC

*** Org

    Ah Org mode. I use Org mode to save my brain from the stress of
    being a brain. I store everything I know and need to do in Org
    mode one way or another. I write all of my talks and blog posts in
    Org mode. For that reason my configuration for Org mode is
    huge. Because it's so big I've split it into sections.

    First let's configure Org =use-package= and start the Org
    configuration block. Additionally we'll setup autoloading commands
    =org-capture= and =org-agenda=. I usually call these before I've
    opened an org file.

    #+BEGIN_SRC emacs-lisp
      (use-package org
        :ensure nil
        :commands (org-capture org-agenda)
        :mode ("\\.org\\'" . org-mode)
    #+END_SRC

**** Key Bindings

     I have some pretty extensive org related key bindings. Some of
     them have org mode defaults that I learned after I developed
     muscle memory for these bindings. There isn't anything special
     about these bindings they are self explanatory based on command
     names. The last thing we do here is start the =:config= section
     of the =use-package= definition.

     #+BEGIN_SRC emacs-lisp
       :bind (("C-c o o"   . helm-org-in-buffer-headings)
              ("C-c o TAB" . org-global-cycle)
              ("C-c o a"   . org-agenda)
              ("C-c o c"   . org-capture)
              ("C-c o r"   . org-archive-subtree)
              ("C-c o m n" . chasinglogic-find-org-file-notes)
              ("C-c o m i" . chasinglogic-find-org-file-ideas)
              ("C-c o m t" . chasinglogic-find-org-file-todo)
              ("C-c o m r" . chasinglogic-add-to-reading-list)
              ("C-c o t"   . org-todo)
              ("C-c o s"   . org-schedule)
              ("C-c o g"   . org-set-tags-command)
              ("C-c o P"   . org-set-property-and-value)
              ("C-c o i l" . org-insert-link)
              ("C-c o i h" . org-insert-heading)
              ("C-c o p p" . org-priority)
              ("C-c o p k" . org-priority-up)
              ("C-c o p j" . org-priority-down))
       :config
     #+END_SRC

**** Org Refile
     I use org refile to organize tasks from my =inbox.org= file to my
     agenda files or notes. I also use it to refile my notes between
     headings in =notes.org.gpg=. These settings do the following things:

     - Add org agenda files to the refile targets.
     - Include the filename in the refile target path, this allows
       creating new top level headings in files via refile.
     - Enable creating new nodes via refile.
     - Disable complete-in-steps and let helm do the filtering.

     #+BEGIN_SRC emacs-lisp
       (setq-default org-refile-targets '((nil :maxlevel . 1)
                                          (org-agenda-files :maxlevel . 2))
                     org-refile-use-outline-path 'file
                     org-outline-path-complete-in-steps nil
                     org-refile-allow-creating-parent-nodes 'confirm)

     #+END_SRC

**** Org Capture

     Org capture is a way to quickly jot or "capture" an idea, todo,
     note etc. 

**** Org Mode Hooks

     This sets my org mode hook that disables
     =display-line-numbers-mode= and =electric-pair-local-mode=.

     #+BEGIN_SRC emacs-lisp
       (defun chasinglogic-org-mode-hook ()
         "Enable some org mode specific settings"
         ;; Electric pair mode makes org links super annoying to write
         (display-line-numbers-mode -1)
         (electric-pair-local-mode -1))
       (add-hook 'org-mode-hook 'chasinglogic-org-mode-hook)
     #+END_SRC

