.emacs.d/init.el
         ("M-y"      . helm-show-kill-ring)
         ("M-i"      . helm-imenu)
         ("M-I"      . helm-imenu-in-all-buffers)
         ("C-x r b"  . helm-bookmarks)
         ("C-x C-f"  . helm-find-files))
  :config
  (setq helm-always-two-windows nil)
  (setq helm-default-display-buffer-functions '(display-buffer-in-side-window))
  (helm-mode 1))

(use-package helm-swoop
  :after helm
  :bind ("C-M-s" . helm-swoop))

(use-package helm-mu
  :after (helm mu4e)
  :hook (mu4e-main-mode-hook .
                             (lambda ()
                               (bind-key "s" helm-mu mu4e-main-mode-map)
                               (bind-key "s" helm-mu mu4e-headers-mode-map)
                               (bind-key "s" helm-mu mu4e-view-mode-map)))
  :bind (("C-c s m" . helm-mu)
         ("C-c s c" . helm-mu-contacts)))

(use-package helm-projectile
  :after (helm projectile)
  :bind (:map projectile-command-map
              ("h" . helm-projectile-find-other-file)
              ("f" . helm-projectile-find-file)
              ("p" . helm-projectile-switch-project)
              ("s" . helm-projectile-rg)))
(use-package helm-rg :after 'helm-projectile)

(use-package helm-org
  :after (helm org)
  :bind (("C-c s o c" . helm-org-capture-templates)
         ("C-c s o h" . helm-org-in-buffer-headings)
         ("C-c o o"   . helm-org-in-buffer-headings)))

(use-package helm-org-rifle
  :after (helm org)
  :bind  ("C-c s o r" . helm-org-rifle))

(use-package company
  :diminish ""
  :config
  (setq-default company-dabbrev-downcase nil)
  (global-company-mode))

(use-package lsp-mode
  :init (setq-default lsp-auto-guess-root t
                      lsp-prefer-flymake nil)
  :commands 'lsp)

(use-package lsp-ui
  :hook 'lsp-mode
  :init
  (setq-default
   lsp-ui-doc-enable nil
   lsp-ui-peek-enable nil
   lsp-ui-sideline-enable nil
   lsp-ui-imenu-enable nil
   lsp-ui-flycheck-enable t))

(use-package company-lsp
  :config (push 'company-lsp company-backends)
  :after (lsp-mode company))

(use-package ccls
  :hook ((c-mode c++-mode objc-mode) .
         (lambda () (require 'ccls) (lsp))))

(use-package org
  :ensure nil
  :commands (org-capture org-agenda)
  :mode ("\\.org\\'" . org-mode)

:bind (("C-c o o"   . helm-org-in-buffer-headings)
       ("C-c o TAB" . org-global-cycle)
       ("C-c o a"   . org-agenda)
       ("C-c o c"   . org-capture)
       ("C-c o r"   . org-archive-subtree)
       ("C-c o m n" . chasinglogic-find-org-file-notes)
       ("C-c o m i" . chasinglogic-find-org-file-ideas)
       ("C-c o m t" . chasinglogic-find-org-file-todo)
       ("C-c o m r" . chasinglogic-add-to-reading-list)
       ("C-c o t"   . org-todo)
       ("C-c o s"   . org-schedule)
       ("C-c o g"   . org-set-tags-command)
       ("C-c o P"   . org-set-property-and-value)
       ("C-c o i l" . org-insert-link)
       ("C-c o i h" . org-insert-heading)
       ("C-c o p p" . org-priority)
       ("C-c o p k" . org-priority-up)
       ("C-c o p j" . org-priority-down))
:config

(setq-default org-refile-targets '((nil :maxlevel . 1)
                                   (org-agenda-files :maxlevel . 2))
              org-refile-use-outline-path 'file
              org-outline-path-complete-in-steps nil
              org-refile-allow-creating-parent-nodes 'confirm)

(defun chasinglogic-org-mode-hook ()
  "Enable some org mode specific settings"
  ;; Electric pair mode makes org links super annoying to write
  (display-line-numbers-mode -1)
  (electric-pair-local-mode -1))
(add-hook 'org-mode-hook 'chasinglogic-org-mode-hook)
