emacs.org
**** Org Mode Settings

     These settings are global variables that inform Org mode
     functions or behavior.

     First we define global variables that describe where common Org
     mode files can be found. I keep all of my Org files in
     =~/Nextcloud/Org= so they are automatically synced to my
     Nextcloud server by my clients.

     #+BEGIN_SRC emacs-lisp
       (setq-default org-directory (file-name-as-directory "~/Nextcloud/Org")
                     org-default-todo-file  (expand-file-name "inbox.org"  org-directory)
                     org-default-notes-file (expand-file-name "notes.org.gpg" org-directory)
                     org-default-ideas-file (expand-file-name "inbox.org" org-directory))
     #+END_SRC

**** Org Agenda

     I use the Org agenda to track what tasks I have to do at any
     given time. I sync this up my Nextcloud instance where it works
     on my phone and iPad via the Beorg app. It's actually a really
     nice system but my primary consumption of this information is via
     agenda views.

     First define what files can contain TODO's for the Agenda:

     #+BEGIN_SRC emacs-lisp
       (setq-default org-agenda-files (list org-default-todo-file
                                            (expand-file-name "todo.org" org-directory)))
     #+END_SRC

     Next define the priorities that are available to tasks. I use
     priorities A - D with A being the highest priority.

     #+BEGIN_SRC emacs-lisp
       (setq-default org-highest-priority ?A
                     org-lowest-priority ?D
                     org-default-priority ?D)
     #+END_SRC

     This variable makes it so when completing a task Org logs the
     time it was completed.

     #+BEGIN_SRC emacs-lisp
       (setq-default org-log-done 'time)
     #+END_SRC

     Make the agenda the only window when a view is selected. I rarely
     want to look at my agenda and something else. I want to focus
     entirely on planning.

     #+BEGIN_SRC emacs-lisp
       (setq-default org-agenda-window-setup 'only-window)
     #+END_SRC

     Now we define the valid TODO states a heading can be in. I use
     three states: TODO, NEXT, and DONE. NEXT means either the next
     task to do for a project or the task I'm currently working on for
     that project.

     #+BEGIN_SRC emacs-lisp
       (setq-default org-todo-keywords '((sequence "TODO(t)" "NEXT(n!)" "STARTED(s!)" "|" "DONE(d!)" "CANCELLED(c!)"))
                     org-todo-keyword-faces '(("TODO" . (:foreground "#cc9393" :weight bold))
                                              ("NEXT" . (:foreground "#b58900" :weight bold))
                                              ("STARTED". (:foreground "#6c71c4" :weight bold))
                                              ("DONE" . (:foreground "green" :weight bold))
                                              ("CANCELLED" . (:foreground "#dc322f"))))
     #+END_SRC


***** TODO Org Mode Task Management Workflow

      This section describes in prose my task management workflow with
      Org mode. The following sections in [[Org Agenda]] will describe the
      configuration that consumes this information. I periodically
      update this and keep it so I can reference and remember why I
      made a decision that I made.

***** Agenda Views

      I configure multiple agenda views for slicing up my tasks so I
      can see what's relevant to me at any given time. See my Notes
      section on [[Org Mode Task Management Workflow]] for information on
      the complete workflow. The important thing to note is that I
      have a small predefined set of tags for use in easily defining
      filters in Agenda views.

      You define views using the variable
      =org-agenda-custom-commands=. I found it very difficult to
      understand the configuration of =org-agenda-custom-commands= at
      first because it's got it's own weird meta programming language
      involved.

      The variable itself is a list of lists. The sub-lists or "views"
      as I will now refer to them have the form =(KEY_TO_ACTIVATE
      DESCRPITION SECTIONS)=. =KEY_TO_ACTIVATE= is the key that must be
      pressed to load the view after =org-agenda= is
      called. =DESCRIPTION= (or "title") is shown next to the key in
      the Org agenda dispatch buffer to describe what the view is. The
      final argument =SECTIONS= is where I got the most hung up
      originally. It is itself a list of lists where these sub lists
      define a "section" of the view. Org agenda views can display
      multiple sections that have different information.

      Sections take the form of =(COMMAND FILTER SETTINGS)=. =COMMAND=
      can be any one of:

      - =agenda=: Returns the daily or weekly agenda. The span
        returned depends on the =SETTINGS= =org-agenda-span=. 
      - =alltodo=: Returns the global todo list.
      - =todo=: Returns todo items.
      - =tags-todo=: Return todo items that match the tag filter.

      There are more commands than I've listed here. These are the
      ones I use and understand for a full listing [[info:org#StoringSearchs][see Storing
      Searches in the Org manual]].

      =FILTER= is applied to all of the commands and is a search as
      defined in the help for =org-search-view= (=C-h f
      org-search-view=). The short version is that it's a regular
      expression or a semi-boolean text search that is applied to the
      headers. There is one exception to this filter behavior:
      =tags-todo=. It takes a special kind of =FILTER= called a "tags
      search". It can match properties and tags in interesting
      full-blown query language ways. See [[info:org#Matching tags andproperties][Matching tags and properties]]
      in the org manual for a complete explanation of the available
      operators.

      See [[info:org#Block Agenda][the Org manual entry for Block Agenda]] for a more
      comprehensive in depth explanation of all available options. The
      following describes my Agenda custom commands.

****** Reading List

       I store my reading list in org mode. I even have a special
       capture template and function for quickly adding links from my
       Emails into the reading list. This view simply finds all
       entries tagged as being on the reading list.

****** Daily Agenda

       This is my most referenced Agenda view. It shows me all
       scheduled items for the day, my "next actions", as well as all
       of stuck projects. My =todo.org= file has top level headings
       that represent projects. Projects range in scope but it's
       usually something that will require more than one step to
       complete. Stuck projects are any level 1 headings in =todo.org=
       that have no NEXT or STARTED subheading.

       We define how to find them via the variable =org-stuck-projects= here:

       #+BEGIN_SRC emacs-lisp
         (setq-default org-stuck-projects '("+LEVEL=1/-DONE" ("STARTED" "NEXT") nil ""))
       #+END_SRC

****** Definition of Agenda Custom Commands

       The code that implements the above views.

      #+BEGIN_SRC emacs-lisp
        (setq-default org-agenda-custom-commands
                      '(

                        ("r" "Reading List"
                         ((tags "+reading_list" ((org-agenda-overriding-header "Reading List")))))

                        ("d" "Daily Agenda"
                         (
                          (agenda
                           ;; Query ("" matches everything)
                           ""
                           ;; Settings 
                           ((org-agenda-overriding-header "Today:")
                            ;; Span 1 day (daily agenda)
                            (org-agenda-span 1)
                            ;; Sort by priority highest to lowest then tag
                            (org-agenda-sorting-strategy '(priority-down tag-up))
                            ;; 7 day advanced warning for deadlines
                            (org-deadline-warning-days 7)))
                          (todo "" ((org-agenda-overriding-header "Next Actions:")
                                    (org-agenda-skip-function '(org-agenda-skip-entry-if 'nottodo '("NEXT" "STARTED")))))
                          (stuck "" ((org-agenda-overriding-header "Stuck Projects:")))))))
      #+END_SRC

***** Capture Templates

      Capture templates are related to Agenda views in that they are
      what feed my TODO list. I keep different templates for the
      different kinds of things I add to the TODO list. It automates
      my tagging system described in [[Org Mode Task Management
      Workflow]].

      First start the declaration of the variable:

      #+BEGIN_SRC emacs-lisp
        (setq-default org-capture-templates '(        
      #+END_SRC

      Each capture template takes the form =(KEY DESCRIPTION TYPE
      TARGET TEMPLATE)=. =KEY= as before is the key to press to
      activate the template when =org-capture= is
      called. =DESCRIPTION= is identical to it's use in [[Agenda Views]].
      
      =TYPE= has the following five possible values. Note that all
      values are symbols not strings.
      
      - =entry=: An Org node with a headline. Will be filed as the
        child of the target entry or as a top-level entry.
      - =item=: A plain list item. Will be placed in the first plain
        list at the target location.
      - =checkitem=: A checkbox item, otherwise behaves the same as
        =item= above.
      - =table-line=: A new line in the first table at target location.
      - =plain=: Text to be inserted as-is.

      I only use entries for now. Perhaps when capturing things that
      are not TODO's I will make use of the other types.

      =TARGET= is a specification of where to put the item. You
      specify using a pseudo-function type query language. The
      available pseudo-functions are:

      - =(file "/path/to/file")=: simply a file target
      - =(file+headline "path/to/file" "node headline")=: Fast
        configuration if the target heading is unique in the file.
      - =(file+regexp "path/to/file" "regexp to find location")=: File
        to the entry matching regexp. Note this is [[Emacs Regular
        Expressions]]

      There are more variants, these are just the ones I use often.
      Not all require the use of =file=. For a full listing view the
      documentation for the variable =org-capture-templates= (=C-h v
      org-capture-templates=).
      
****** Capture: TODO

       This is the simplest, and probably most used, capture template I
       have. It just records a TODO item with the default priority of
       =M=.

       #+BEGIN_SRC emacs-lisp
         ("t" "Task todo" entry (file org-default-todo-file) "* TODO %?")
       #+END_SRC
       
****** Capture: Reading List

       This captures a TODO item that should be on my reading list. I
       most frequently interact with this template via my utility
       function =chasinglogic-add-to-reading-list= which is defined
       later on in this document. It will capture whatever text is in
       the active region.

       #+BEGIN_SRC emacs-lisp
         ("r" "Reading list" entry (file org-default-todo-file)
          "* TODO %i %? :reading_list:
:PROPERTIES:
:CREATED: %t
:END:")
       #+END_SRC

****** Capture: Notes

       A generic Note capture this should always be a top level
       heading. More often then not I manage the =notes.org= buffer
       directly instead of via capture but occasionally I'll want to
       just jot or start something and the buffer won't be immediately
       available. This entry will be prepended, added to the top of the
       notes buffer, since I list my notes in the buffer in reverse
       chronological order of their creation.

       #+BEGIN_SRC emacs-lisp
         ("n" "A new note" entry (file org-default-notes-file) "* %?" :prepend t)
       #+END_SRC

****** Capture: Interview

       When conducting an interview I file this into my Notes under the
       Interviews heading. I also tag these entries with the dates they
       were conducted on.

       #+BEGIN_SRC emacs-lisp
         ("I" "Interview"
          entry (file+headline org-default-notes-file "Interviews")
          "** Interviewee: %? :interview:
         :PROPERTIES:
         :DATE: %t
         :END:

         ")
       #+END_SRC
****** Capture: Idea

       Ideas are captured with the date they were conceived. This
       template automatically adds this property to the
       entry. Additionally it tags the item as an idea for use in my
       Agenda view filtering.

       #+BEGIN_SRC emacs-lisp
         ("i" "Idea" entry (file org-default-todo-file)
          "* TODO %? :idea:
:PROPERTIES
:DATE: %t
:END:
         ")
       #+END_SRC

****** End capture template definition

       Close the =setq= expression for capture templates.

       #+BEGIN_SRC emacs-lisp
         ))
       #+END_SRC

