.emacs.d/init.el

(setq-default org-directory (file-name-as-directory "~/Nextcloud/Org")
              org-default-todo-file  (expand-file-name "inbox.org"  org-directory)
              org-default-notes-file (expand-file-name "notes.org.gpg" org-directory)
              org-default-ideas-file (expand-file-name "inbox.org" org-directory))

(setq-default org-agenda-files (list org-default-todo-file
                                     (expand-file-name "todo.org" org-directory)))

(setq-default org-highest-priority ?A
              org-lowest-priority ?D
              org-default-priority ?D)

(setq-default org-log-done 'time)

(setq-default org-agenda-window-setup 'only-window)

(setq-default org-todo-keywords '((sequence "TODO(t)" "NEXT(n!)" "STARTED(s!)" "|" "DONE(d!)" "CANCELLED(c!)"))
              org-todo-keyword-faces '(("TODO" . (:foreground "#cc9393" :weight bold))
                                       ("NEXT" . (:foreground "#b58900" :weight bold))
                                       ("STARTED". (:foreground "#6c71c4" :weight bold))
                                       ("DONE" . (:foreground "green" :weight bold))
                                       ("CANCELLED" . (:foreground "#dc322f"))))

(setq-default org-stuck-projects '("+LEVEL=1/-DONE" ("STARTED" "NEXT") nil ""))

(setq-default org-agenda-custom-commands
              '(

                ("r" "Reading List"
                 ((tags "+reading_list" ((org-agenda-overriding-header "Reading List")))))

                ("d" "Daily Agenda"
                 (
                  (agenda
                   ;; Query ("" matches everything)
                   ""
                   ;; Settings 
                   ((org-agenda-overriding-header "Today:")
                    ;; Span 1 day (daily agenda)
                    (org-agenda-span 1)
                    ;; Sort by priority highest to lowest then tag
                    (org-agenda-sorting-strategy '(priority-down tag-up))
                    ;; 7 day advanced warning for deadlines
                    (org-deadline-warning-days 7)))
                  (todo "" ((org-agenda-overriding-header "Next Actions:")
                            (org-agenda-skip-function '(org-agenda-skip-entry-if 'nottodo '("NEXT" "STARTED")))))
                  (stuck "" ((org-agenda-overriding-header "Stuck Projects:")))))))

(setq-default org-capture-templates '(

("t" "Task todo" entry (file org-default-todo-file) "* TODO %?")

("r" "Reading list" entry (file org-default-todo-file)
          "* TODO %i %? :reading_list:
:PROPERTIES:
:CREATED: %t
:END:")

("n" "A new note" entry (file org-default-notes-file) "* %?" :prepend t)

("I" "Interview"
 entry (file+headline org-default-notes-file "Interviews")
 "** Interviewee: %? :interview:
:PROPERTIES:
:DATE: %t
:END:

")

("i" "Idea" entry (file org-default-todo-file)
          "* TODO %? :idea:
:PROPERTIES
:DATE: %t
:END:
         ")

))

(defun chasinglogic-add-to-reading-list ()
  (interactive)
