emacs.org
**** Org Utility Functions and Automation

     As my Org workflow becomes more complete I occasionally write new
     commands or functions that automate some piece of it. These
     commands are created here.
     
***** Add to reading list 

      I get a lot of weekly newsletter emails. Since I read my email
      in Emacs I can quickly add the link under the point to my
      reading list with this command. It will grab the link, make an
      HTTP request to try and find the title of the webpage then
      insert a reading list entry whose heading is a link with the
      display text of the title of the page. I find the extra step to
      determine the page title can be slow but is worth it for two
      reasons:

      - Reading links to determine their target is hard on Mobile
        where I consume the reading list the most.
      - A lot of newsletters use affialiate or click tracking links so
        the links often have no indication of where they actually go.

      #+BEGIN_SRC emacs-lisp
        (defun chasinglogic-add-to-reading-list ()
          (interactive)
          (let ((url (thing-at-point 'url)))
            (org-capture-string
             (concat "[[" url "]["
                     ;; Get the link title if possible
                     (condition-case nil
                         ;; Get title of web page, with the help of functions in url.el
                         (with-current-buffer (url-retrieve-synchronously url)
                           ;; find title by grep the html code
                           (goto-char 0)
                           (re-search-forward "<title>\\([^<]*\\)</title>" nil t 1)
                           (setq web_title_str (match-string 1))
                           ;; find charset by grep the html code
                           (goto-char 0)
                           (re-search-forward "charset=\\([-0-9a-zA-Z]*\\)" nil t 1)
                           ;; downcase the charaset. e.g, UTF-8 is not acceptible for emacs, while utf-8 is ok.
                           (setq coding_charset (downcase (match-string 1)))
                           ;; Sometimes titles have newlines but that breaks our org link so strip them.
                           (replace-regexp-in-string
                            "\n" ""
                            ;; decode the string of title.
                            (decode-coding-string web_title_str (intern coding_charset))))
                       ;; Work even in the case of transient network failure. If
                       ;; so just use the url as the title.
                       (error url))
                     "]]")
             "r")
            (org-capture-finalize)))
      #+END_SRC

**** Org Export

     Org export (ox) is one of the best features of Org. It lets me
     write in the format I've most used and then distribute in
     whatever format is required. It supports a wide array of output
     formats and requires very little configuration.

     One of the settings I like to set is =org-export-headline-levels=
     The default value is 3 which I find a little too small. So I
     double it to 6.

     #+BEGIN_SRC emacs-lisp
       (setq-default org-export-headline-levels 6)
     #+END_SRC

     Next we enable some additional export formats. Markdown, which
     ships with Emacs and Org mode by default is not enabled by
     defualt and is probably my most common target so we always load
     it here.

     #+BEGIN_SRC emacs-lisp
       (require 'ox-md)
     #+END_SRC

     Next we install and require the =ox-reveal= package. This lets me
     export Org files as full blown slideshow presentations for use in
     my browser.

     #+BEGIN_SRC emacs-lisp
       (use-package ox-reveal :config (require 'ox-reveal))
     #+END_SRC

**** Org Babel

     I obviously use babel pretty extensively as I generate all of my
     dotfiles and Emacs configuration using it. Luckily the defaults
     are pretty great so it needs very little configuration. One issue
     I've run into is that I prefer to use Python for generation in a
     Babel file but it's now loaded by default. This setting makes it
     so elisp and Python code blocks are executable in any Org buffer.

     #+BEGIN_SRC emacs-lisp
       (setq-default org-babel-load-languages '((emacs-lisp . t)
                                                (python . t)))
     #+END_SRC
     
**** End Org Configuration

     Close the Org configuration block.

     #+BEGIN_SRC emacs-lisp
       )
     #+END_SRC

**** Org Bullets

     Org bullets replaces the basic =*= characters with prettier UTF-8
     bullet points in the outline. It's just more aesthetically
     pleasing I think and makes it clearer what level I'm working at
     when the subtree isn't narrowed.

     #+BEGIN_SRC emacs-lisp
       (use-package org-bullets
         :after org
         :hook '(org-mode . org-bullets-mode))
     #+END_SRC

**** TODO Org2blog

     Having recently switch to Wordpress this might be the best way to
     post my blogs from Org mode.

*** Flycheck

    Every good editor has syntax checking and Emacs is no different. I
    use Flycheck for this since it's the most consistent, best
    defaults, and functional package I've found for it. Flymake
    recently got a rewrite in Emacs core but I still prefer
    Flycheck. I do not install many =flycheck-*= packages as I use
    =lsp-mode= which integrates with Flycheck and for everything else
    the Flycheck defaults work great.

    I diminish Flycheck because it's almost always enabled so no
    reason to pollute the mode-line. Additionally I set the variable
    =flycheck-sh-posix-dash-executable= to an empty string. Most
    people, I certainly didn't, don't know that there is a
    minimalistic bash alternative called =dash= that is on a lot of
    Debian systems. It's an awful shell IMO but Flycheck supports
    linting for it. I use Dash.app on my Macbook and so Flycheck
    constanstly opens Dash.app and freaks out whenever I'm in a
    =sh-mode= buffer. Setting this to an empty string prevents
    Flycheck from trying to test Dash shell syntax.

    I enable Flycheck for all text modes.

    #+BEGIN_SRC emacs-lisp
      (use-package flycheck
        :diminish ""
        :bind (("C-c e l" . flycheck-list-errors)
               ("C-c e v" . flycheck-verify-setup)
               ("C-c e n" . flycheck-next-error)
               ("C-c e p" . flycheck-previous-error))
        :hook 'text-mode-hook
        :config
        ;; this trys to run the dash shell which I don't use but instead
        ;; opens the Dash.app program which I do use.
        (setq flycheck-sh-posix-dash-executable ""))
    #+END_SRC

**** Flycheck Vale

     The only additional Flycheck linter package I install is Flycheck
     Vale. This integrates the awesome [[https://github.com/errata-ai/vale][Vale prose linter]] with
     Flycheck. I use this for all my prose.

     #+BEGIN_SRC emacs-lisp
       (use-package flycheck-vale
         :after 'flycheck
         :config
         (flycheck-vale-setup))
     #+END_SRC

*** magit

    Magit is another of those top 5 packages. It's almost a reason to
    use Emacs in and of itself. Here we only rebind some keys from
    =vc-mode= based defaults to =magit= commands.

    #+BEGIN_SRC emacs-lisp
      (use-package magit
        :bind (("C-x v d" . magit-diff)
               ("C-x v b" . magit-blame)
               ("C-x v l" . magit-log-current)
               ("C-x v a" . magit-stage-file)
               ("C-x v c" . magit-commit)
               ("C-x v s" . magit-status))
        :commands 'magit-status)
    #+END_SRC

*** xgen-cru (MongoDB Code Reviews)

    =xgen-cru= is an internal tool for posting code reviews to
    Rietveld. It's an Emacs wrapper around our Python script that most
    people use. I keep it in a directory called =kernel-tools= and I
    use =use-package= to load it from this local directory. I only set
    a few options so it will pass my work email to the script.

    #+BEGIN_SRC emacs-lisp
      (eval-and-compile
        (setq-default kernel-tools (concat (getenv "HOME") "/Work/kernel-tools/codereview")))

      (use-package xgen-cru
        :load-path kernel-tools
        :commands (xgen-cru-update-review xgen-cru-post-review)
        :config
        (setq-default
         xgen-cru-upload-email "mathew.robinson@mongodb.com"
         xgen-cru-jira-username "mathew.robinson"
         xgen-cru-upload-py-path (concat kernel-tools "/upload.py")))
    #+END_SRC

*** mu4e (Email)

    I read my Email in Emacs using the excellent mu tool and it's
    companion Emacs client mu4e (mu 4 Emacs). It is not packaged on
    any ELPA repository and has to be installed with the companion
    tool via the system package manager. I have ansible playbooks that
    do this for me but it's not always there the first time I run
    Emacs. We dynamically find the load path so it uses the correct
    location on MacOS and Linux.

    Next if the directory exists we load mu4e from this
    directory. Additionally we bind =C-c m= to launch mu4e and begin
    our configuration section.

    #+BEGIN_SRC emacs-lisp
      (eval-and-compile
        (setq-default mu4e-load-path (if (eq system-type 'darwin)
                                         "/usr/local/share/emacs/site-lisp/mu/mu4e"
                                       "/usr/share/emacs/site-lisp/mu4e")))
      (when (file-exists-p mu4e-load-path)
        (use-package mu4e
          :load-path mu4e-load-path
          :bind ("C-c m" . mu4e)
          :config
    #+END_SRC

