.emacs.d/init.el
  (let ((url (thing-at-point 'url)))
    (org-capture-string
     (concat "[[" url "]["
             ;; Get the link title if possible
             (condition-case nil
                 ;; Get title of web page, with the help of functions in url.el
                 (with-current-buffer (url-retrieve-synchronously url)
                   ;; find title by grep the html code
                   (goto-char 0)
                   (re-search-forward "<title>\\([^<]*\\)</title>" nil t 1)
                   (setq web_title_str (match-string 1))
                   ;; find charset by grep the html code
                   (goto-char 0)
                   (re-search-forward "charset=\\([-0-9a-zA-Z]*\\)" nil t 1)
                   ;; downcase the charaset. e.g, UTF-8 is not acceptible for emacs, while utf-8 is ok.
                   (setq coding_charset (downcase (match-string 1)))
                   ;; Sometimes titles have newlines but that breaks our org link so strip them.
                   (replace-regexp-in-string
                    "\n" ""
                    ;; decode the string of title.
                    (decode-coding-string web_title_str (intern coding_charset))))
               ;; Work even in the case of transient network failure. If
               ;; so just use the url as the title.
               (error url))
             "]]")
     "r")
    (org-capture-finalize)))

(setq-default org-export-headline-levels 6)

(require 'ox-md)

(use-package ox-reveal :config (require 'ox-reveal))

(setq-default org-babel-load-languages '((emacs-lisp . t)
                                         (python . t)))

)

(use-package org-bullets
  :after org
  :hook '(org-mode . org-bullets-mode))

(use-package flycheck
  :diminish ""
  :bind (("C-c e l" . flycheck-list-errors)
         ("C-c e v" . flycheck-verify-setup)
         ("C-c e n" . flycheck-next-error)
         ("C-c e p" . flycheck-previous-error))
  :hook 'text-mode-hook
  :config
  ;; this trys to run the dash shell which I don't use but instead
  ;; opens the Dash.app program which I do use.
  (setq flycheck-sh-posix-dash-executable ""))

(use-package flycheck-vale
  :after 'flycheck
  :config
  (flycheck-vale-setup))

(use-package magit
  :bind (("C-x v d" . magit-diff)
         ("C-x v b" . magit-blame)
         ("C-x v l" . magit-log-current)
         ("C-x v a" . magit-stage-file)
         ("C-x v c" . magit-commit)
         ("C-x v s" . magit-status))
  :commands 'magit-status)

(eval-and-compile
  (setq-default kernel-tools (concat (getenv "HOME") "/Work/kernel-tools/codereview")))

(use-package xgen-cru
  :load-path kernel-tools
  :commands (xgen-cru-update-review xgen-cru-post-review)
  :config
  (setq-default
   xgen-cru-upload-email "mathew.robinson@mongodb.com"
   xgen-cru-jira-username "mathew.robinson"
   xgen-cru-upload-py-path (concat kernel-tools "/upload.py")))

(eval-and-compile
  (setq-default mu4e-load-path (if (eq system-type 'darwin)
                                   "/usr/local/share/emacs/site-lisp/mu/mu4e"
                                 "/usr/share/emacs/site-lisp/mu4e")))
(when (file-exists-p mu4e-load-path)
  (use-package mu4e
    :load-path mu4e-load-path
    :bind ("C-c m" . mu4e)
    :config
