.emacs.d/init.el

(setq-default mu4e-maildir "~/Mail")

(setq-default mu4e-get-mail-command "true")

(setq-default mu4e-confirm-quit nil
              message-kill-buffer-on-exit t)

(setq-default mu4e-headers-show-threads nil
              mu4e-headers-include-related nil
              mu4e-context-policy 'pick-first)

(setq-default mu4e-split-view 'horizontal)

(setq-default mu4e-sent-messages-behavior 'delete)

(setq-default mu4e-view-show-images t
              mu4e-view-show-addresses t
              mu4e-use-fancy-chars t)

(setq-default mu4e-compose-format-flowed t)

(setq-default mu4e-update-interval 300)

(setq-default message-send-mail-function 'message-smtpmail-send-it
              send-mail-function 'smtpmail-send-it)

(setq-default shr-use-colors nil
              shr-color-visible-luminance-min 100
              mu4e-html2text-command 'mu4e-shr2text)

(add-hook 'mu4e-view-mode-hook
          (lambda()
            ;; try to emulate some of the eww key-bindings
            (local-set-key (kbd "<tab>") 'shr-next-link)
            (local-set-key (kbd "<backtab>") 'shr-previous-link)))

(setq-default mail-user-agent 'mu4e-user-agent)

(add-hook 'mu4e-main-mode-hook '(lambda () (set-frame-name "Email")))

(setq-default mu4e-contexts `(

,(make-mu4e-context
  :name "Work"
  :match-func (lambda (msg)
                (when msg
                  (string-prefix-p "/work" (mu4e-message-field msg :maildir))))
  :vars '(
          (mu4e-drafts-folder . "/work/drafts")
          (mu4e-sent-folder . "/work/sent")
          (mu4e-trash-folder . "/work/trash")
          (mu4e-refile-folder . "/work/archive")
          (smtpmail-stream-type . nil)
          (smtpmail-local-domain . "gmail.com")
          (smtpmail-default-smtp-server . "smtp.gmail.com")
          (smtpmail-smtp-server . "smtp.gmail.com")
          (smtpmail-smtp-service . 587)
          (smtpmail-smtp-user . "mathew.robinson@10gen.com")
          (user-mail-address . "mathew.robinson@mongodb.com")
          )
  )

,(make-mu4e-context
  :name "Personal"
  :match-func (lambda (msg)
                (when msg
                  (string-prefix-p "/personal" (mu4e-message-field msg :maildir))))
  :vars '(
          (mu4e-drafts-folder . "/personal/Drafts")
          (mu4e-sent-folder . "/personal/Sent")
          (mu4e-trash-folder . "/personal/Trash")
          (mu4e-refile-folder . "/personal/Archive")
          (smtpmail-stream-type . ssl)
          (smtpmail-smtp-server . "smtp.fastmail.com")
          (smtpmail-smtp-service . 465)
          (smtpmail-local-domain . "chasinglogic.io")
          (smtpmail-smtp-user . "mathew@chasinglogic.io")
          (user-mail-address . "mathew@chasinglogic.io")
          )
  )
)) ;; End the context setq

(setq-default mu4e-bookmarks
              `(
                ,(make-mu4e-bookmark
                  :name  "Inbox"
                  :query "(maildir:/personal/INBOX OR maildir:/work/INBOX) AND (flag:unread OR flag:flagged) AND NOT flag:trashed"
                  :key ?i)
                ,(make-mu4e-bookmark
                  :name  "Unread messages"
                  :query "flag:unread AND NOT flag:trashed"
                  :key ?u)
                ,(make-mu4e-bookmark
                  :name "Flagged (Starred)"
                  :query "flag:flagged"
                  :key ?f)
                ,(make-mu4e-bookmark
                  :name "Today's messages"
                  :query "(date:today..now)"
                  :key ?t)
                ))

(add-hook 'mu4e-compose-mode-hook 'auto-fill-mode)
(add-hook 'mu4e-compose-mode-hook 'mml-secure-message-sign)

)
