emacs.org
**** mu4e alert

     mu4e alert is a must have package if using mu4e. It periodically
     updates the mu index and if new messages are found by the
     interesting mail query then it sends a dbus
     notification. Additionally it adds an unread email count to the
     mode line.

     #+BEGIN_SRC emacs-lisp
       (use-package mu4e-alert
         :after mu4e
         :hook (mu4e-main-mode-hook . (lambda ()
                                        (setq mu4e-alert-interesting-mail-query
                                              "(flag:unread maildir:/personal/Inbox) OR (flag:unread maildir:/work/INBOX)")
                                        (when (eq system-type 'gnu/linux)
                                          (mu4e-alert-set-default-style 'libnotify))
                                        (mu4e-alert-enable-mode-line-display)
                                        (mu4e-alert-enable-notifications))))
     #+END_SRC

**** End mu4e when condition

     This ends the when condition that determines if mu4e should be
     loaded at all.

     #+BEGIN_SRC emacs-lisp
       )
     #+END_SRC

*** Git Link

    This packages opens and creates github links from within
    Emacs. It's super handy for linking someone to a line in the code
    base from Emacs. The few settings here make it link to the master
    branch, otherwise it would try to use my local checked out branch,
    and to open the link in my browser so I can verify the link before
    sending to someone.

    #+BEGIN_SRC emacs-lisp
      (use-package git-link
        :commands (git-link git-link-commit git-link-homepage)
        :config
        (setq-default
         git-link-default-branch "master"
         git-link-open-in-browser t))
    #+END_SRC

*** Yasnippet

    Yasnippet is definitely in my top 5 packages. It's the most
    powerful and simple snippet system I've ever used. You can program
    snippets with elisp to generate code or you can write simple
    TextMate style snippets that just define tab stops. No
    configuration required on this one just type a snippet identifier
    and press tab.

    #+BEGIN_SRC emacs-lisp
      (use-package yasnippet
        :diminish 'yas-minor-mode
        :config (yas-global-mode 1))
    #+END_SRC

*** Projectile

    Projectile is one of my most used packages. It provides searching for
    and searching in projects (git repositories). It's a much more
    powerful "Ctrl-P" equivalent. I do some customization to
    projectile. First I rebind some of the default keys in the
    =projectile-command-map= to mnemonics that I remember better. Then
    I bind =C-c p= to the =projectile-command-map=.

    For actual behavioral changes I create a custom switch project
    action that opens =magit-status= in a single window view. I
    disable projectile when the =default-directory= is not a source
    code repository. I disable caching since I don't run on Windows
    and native methods are pretty fast. I also set the
    =projectile-tags-command= to none. I don't like how it tried to
    run without being asked causing Emacs to prompt me. Finally I
    integrate it with my "frame naming system" so that when I switch
    to a project the frame name will the project name.

    I also on startup load all projector projects into projectile so
    switch project will at startup show me all of my projects even if
    I haven't visited them in Emacs yet.

    #+BEGIN_SRC emacs-lisp
      (use-package projectile
        :bind-keymap ("C-c p" . projectile-command-map)
        :bind ((:map projectile-command-map
                     ("p" . projectile-switch-project)
                     ("f" . projectile-find-file)
                     ("F" . projectile-find-file-in-known-projects)
                     ("d" . projectile-find-dir)
                     ("b" . projectile-switch-to-buffer)))
        :init
        (chasinglogic-add-projector-projects-to-projectile)
        :config
        (defun chasinglogic-switch-project-action ()
          "Single view magit status page when switching projects."
          (interactive)
          (magit-status)
          (delete-other-windows))

        (setq-default projectile-require-project-root t
                      projectile-completion-system 'helm
                      projectile-enable-caching nil
                      ;; I prefer a git status when switching to a project
                      projectile-switch-project-action 'chasinglogic-switch-project-action
                      ;; I really don't need tags
                      projectile-tags-command "")
        ;; When switching projects set frame name to project name
        (defun set-frame-name-to-project ()
          (set-frame-parameter (selected-frame) 'name (projectile-project-name)))
        (add-hook 'projectile-after-switch-project-hook 'set-frame-name-to-project))
    #+END_SRC

*** Writeroom Mode

    Writeroom Mode is a simple but great package that provides a
    focused editing experience. It removes all chrome and centers the
    buffer on the window so you can focus only on the prose.

    #+BEGIN_SRC emacs-lisp
      (use-package writeroom-mode :commands (writeroom-mode))
    #+END_SRC

*** Highlight TODO mode

    By default Emacs doesn't highlight TODO comments. This makes them
    stand out by fontifying them the same as Org mode TODO header
    keywords.

    #+BEGIN_SRC emacs-lisp
      (use-package hl-todo
        :demand
        :config
        (global-hl-todo-mode))
    #+END_SRC

** Programming Languages
*** Ruby

    I don't do much writing of Ruby so I find the built in =ruby-mode=
    pretty much adequate with one exception: automatically adding
    =end= where needed.

    This package extends =electric-pair-mode= to handle languages like
    Ruby where the closing pair can sometimes be a word or other
    stranger set of symbols. In short it automatically adds =end= for
    =if='s, =functions='s, and loops in Ruby.

    #+BEGIN_SRC emacs-lisp
      (use-package ruby-electric
        :diminish ""
        :hook 'ruby-mode)
    #+END_SRC

*** Python

    I write a lot of Python code. Luckily I only write Python 3 code
    nowadays so the first thing to do is set the
    =python-shell-interpreter= variable to Python 3. Additionally tell
    Flycheck to always use this variable for the various Python
    linters it runs.

    #+BEGIN_SRC emacs-lisp
      ;; Use correct Python3
      (setq-default python-shell-interpreter (if (eq system-type 'darwin)
                                                 "/usr/local/bin/python3"
                                               "python3"))
      (setq-default flycheck-python-flake8-executable python-shell-interpreter
                    flycheck-python-pylint-executable python-shell-interpreter
                    flycheck-python-pycompile-executable python-shell-interpreter)
    #+END_SRC

    Next I use the Black Python formatter for my code. This package
    integrates it into Emacs and lets me run it as an after save
    hook. My hook has to be a little smarter however because my work
    projects do not use this formatter so define a "black list" for
    Black and only add the hook if we aren't in one of those projects.

    #+BEGIN_SRC emacs-lisp
      (use-package blacken
        :commands 'blacken-buffer
        :init
        (setq-default chasinglogic-blacken-black-list
                      '("scons"
                        "mongo"
                        "enterprise"
                        "mongo_modules_enterprise"
                        "toolchain-builder"
                        "kernel-tools"))

        (defun chasinglogic-python-format-hook ()
          "Set up blacken-buffer on save if appropriate."
          (unless (member (projectile-project-name) chasinglogic-blacken-black-list) 
            (message "Not in a blacklisted project, enabling format on save.")
            (add-hook 'before-save-hook 'blacken-buffer nil t)))
        (add-hook 'python-mode-hook 'chasinglogic-python-format-hook))
    #+END_SRC

    Making Emacs and virtualenvs work together has been one of the
    most frustrating things about my time with Emacs. After literal
    years of tweaking and testing I finally have a solution that I
    like. I use =virtualenvwrapper= to create my virtualenvs with
    names that match the names returned by
    =(projectile-project-name)=, essentially this is just the basename
    of the project directory. Then whenever I run
    =projectile-switch-project= check for a matching virtualenv if so
    activate it with the =pyvenv= package.

    #+BEGIN_SRC emacs-lisp
      (use-package pyvenv
        :commands 'pyvenv-workon
        :after 'projectile
        :init
        (defun chasinglogic-auto-venv ()
          "Automatically setup the venv when entering a project"
          (when (file-exists-p (concat "~/.virtualenvs/" (projectile-project-name)))
            (pyvenv-workon (projectile-project-name))))
        (add-hook 'projectile-after-switch-project-hook 'chasinglogic-auto-venv))
    #+END_SRC

    Finally enable LSP mode in Python buffers and make Emacs treat
    SCons build configuration files as python.

    #+BEGIN_SRC emacs-lisp
      (add-hook 'python-mode-hook #'lsp)
      ;; Load SCons files as Python
      (add-to-list 'auto-mode-alist '("SConscript" . python-mode))
      (add-to-list 'auto-mode-alist '("SConstruct" . python-mode))
      (add-to-list 'auto-mode-alist '("\\.vars\\'" . python-mode))
    #+END_SRC

*** TypeScript

    Nothing much to be done for TypeScript except install the major
    mode as I don't work on it all that much.

    #+BEGIN_SRC emacs-lisp
      (use-package typescript-mode
        :mode "\\.ts\\'"
        :config
        (add-hook typescript-mode-hook 'lsp))
    #+END_SRC
    
*** Markdown Mode

    I really like Markdown. I obviously use Org mode whenever possible
    but for those times when i need to write markdown this major mode
    makes it the best editing experience I've had for markdown.

    Not much configuration is required here except to bind it to the
    correct file extensions, make it fontify source blocks according
    to the correct major mode, disable line numbers, and enable spell
    checking.

    #+BEGIN_SRC emacs-lisp
      (use-package markdown-mode
        :mode ("\\.markdown\\'" "\\.md\\'")
        :config
        ;; Use ndoc for exporting to HTML
        (setq-default markdown-command "pandoc")

        (defun chasinglogic-markdown-mode-hook ()
          "Disable line numbers and auto-wrap at 80 in Markdown"
          (markdown-toggle-fontify-code-block-natively)
          (display-line-numbers-mode -1)
          (flyspell-mode 1)
          (auto-fill-mode 1))

        (add-hook 'markdown-mode-hook 'chasinglogic-markdown-mode-hook))
    #+END_SRC

