.emacs.d/init.el

(use-package mu4e-alert
  :after mu4e
  :hook (mu4e-main-mode-hook . (lambda ()
                                 (setq mu4e-alert-interesting-mail-query
                                       "(flag:unread maildir:/personal/Inbox) OR (flag:unread maildir:/work/INBOX)")
                                 (when (eq system-type 'gnu/linux)
                                   (mu4e-alert-set-default-style 'libnotify))
                                 (mu4e-alert-enable-mode-line-display)
                                 (mu4e-alert-enable-notifications))))

)

(use-package git-link
  :commands (git-link git-link-commit git-link-homepage)
  :config
  (setq-default
   git-link-default-branch "master"
   git-link-open-in-browser t))

(use-package yasnippet
  :diminish 'yas-minor-mode
  :config (yas-global-mode 1))

(use-package projectile
  :bind-keymap ("C-c p" . projectile-command-map)
  :bind ((:map projectile-command-map
               ("p" . projectile-switch-project)
               ("f" . projectile-find-file)
               ("F" . projectile-find-file-in-known-projects)
               ("d" . projectile-find-dir)
               ("b" . projectile-switch-to-buffer)))
  :init
  (chasinglogic-add-projector-projects-to-projectile)
  :config
  (defun chasinglogic-switch-project-action ()
    "Single view magit status page when switching projects."
    (interactive)
    (magit-status)
    (delete-other-windows))

  (setq-default projectile-require-project-root t
                projectile-completion-system 'helm
                projectile-enable-caching nil
                ;; I prefer a git status when switching to a project
                projectile-switch-project-action 'chasinglogic-switch-project-action
                ;; I really don't need tags
                projectile-tags-command "")
  ;; When switching projects set frame name to project name
  (defun set-frame-name-to-project ()
    (set-frame-parameter (selected-frame) 'name (projectile-project-name)))
  (add-hook 'projectile-after-switch-project-hook 'set-frame-name-to-project))

(use-package writeroom-mode :commands (writeroom-mode))

(use-package hl-todo
  :demand
  :config
  (global-hl-todo-mode))

(use-package ruby-electric
  :diminish ""
  :hook 'ruby-mode)

;; Use correct Python3
(setq-default python-shell-interpreter (if (eq system-type 'darwin)
                                           "/usr/local/bin/python3"
                                         "python3"))
(setq-default flycheck-python-flake8-executable python-shell-interpreter
              flycheck-python-pylint-executable python-shell-interpreter
              flycheck-python-pycompile-executable python-shell-interpreter)

(use-package blacken
  :commands 'blacken-buffer
  :init
  (setq-default chasinglogic-blacken-black-list
                '("scons"
                  "mongo"
                  "enterprise"
                  "mongo_modules_enterprise"
                  "toolchain-builder"
                  "kernel-tools"))

  (defun chasinglogic-python-format-hook ()
    "Set up blacken-buffer on save if appropriate."
    (unless (member (projectile-project-name) chasinglogic-blacken-black-list) 
      (message "Not in a blacklisted project, enabling format on save.")
      (add-hook 'before-save-hook 'blacken-buffer nil t)))
  (add-hook 'python-mode-hook 'chasinglogic-python-format-hook))

(use-package pyvenv
  :commands 'pyvenv-workon
  :after 'projectile
  :init
  (defun chasinglogic-auto-venv ()
    "Automatically setup the venv when entering a project"
    (when (file-exists-p (concat "~/.virtualenvs/" (projectile-project-name)))
      (pyvenv-workon (projectile-project-name))))
  (add-hook 'projectile-after-switch-project-hook 'chasinglogic-auto-venv))

(add-hook 'python-mode-hook #'lsp)
;; Load SCons files as Python
(add-to-list 'auto-mode-alist '("SConscript" . python-mode))
(add-to-list 'auto-mode-alist '("SConstruct" . python-mode))
(add-to-list 'auto-mode-alist '("\\.vars\\'" . python-mode))

(use-package typescript-mode
  :mode "\\.ts\\'"
  :config
  (add-hook typescript-mode-hook 'lsp))

(use-package markdown-mode
  :mode ("\\.markdown\\'" "\\.md\\'")
  :config
  ;; Use ndoc for exporting to HTML
  (setq-default markdown-command "pandoc")

  (defun chasinglogic-markdown-mode-hook ()
    "Disable line numbers and auto-wrap at 80 in Markdown"
    (markdown-toggle-fontify-code-block-natively)
    (display-line-numbers-mode -1)
    (flyspell-mode 1)
    (auto-fill-mode 1))

  (add-hook 'markdown-mode-hook 'chasinglogic-markdown-mode-hook))
