emacs.org
*** Web Mode

    Web mode is great. It does everything other text editors can't and
    treats tags as native source blocks of the appropriate type
    (i.e. =script= tags get fontified and treated as if they're in a
    Javacript mode "sub buffer", same for CSS). I don't do much web
    programming or templating nowadays but this is configured so I can
    effectively when required.

    The only settings here are configuring a local tab width of 2 (the
    Javascript default) and setting up case statements to indent
    according to eslint's desired configuration.

    #+BEGIN_SRC emacs-lisp
      (use-package web-mode
        :commands (web-mode)
        :mode ("\\.html?\\'" "\\.tmpl\\'" "\\.css\\'"
               "\\.scss\\'" "\\.erb\\'" "\\.djhtml\\'"
               "\\.tsx\\'")
        :config
        (setq-default js-ident-level 2
                      javascript-ident-level 2
                      js2-basic-offset 2)
        (defun chasinglogic-web-mode-hook ()
          ;; indent case statements
          (c-set-offset 'case-label '+))
        (add-hook 'web-mode-hook 'chasinglogic-web-mode-hook)
        (add-hook 'web-mode-hook 'lsp)
        (flycheck-add-mode 'javascript-eslint 'web-mode)
        (flycheck-add-next-checker 'javascript-eslint 'jsx-tide 'append)

        (setq-default web-mode-markup-indent-offset 2
                      web-mode-style-indent-offset 2
                      web-mode-code-indent-offset 2))

    #+END_SRC

*** C / C++

    I have to read more C++ than I have to write but for those times
    when I do this configuration ensures that my code is formatted,
    correct, and ready to commit.

    First we install the =clang-format= package and point it at the
    MongoDB toolchain binary since it's always the right version.

    #+BEGIN_SRC emacs-lisp
      (use-package clang-format
        :commands (clang-format-buffer)
        :config
        (setq clang-format-binary "/opt/mongodbtoolchain/v3/bin/clang-format"))
    #+END_SRC

    Next create a C++ mode hook that makes Emacs format / indent
    things correctly according to MongoDB's style guide. Additionally
    make it so Flycheck will pass ~-std=c++17~ when doing syntax
    checking and to allow =src= directory relative
    =#includes=. Finally make it such that header files are treated as
    C++ and not C.

    #+BEGIN_SRC emacs-lisp
      (defun chasinglogic-cpp-mode-hook ()
        "Set up various C++ tools and options."
        ;; Don't indent namespaces
        (c-set-offset 'innamespace [0])
        (setq-local c-basic-offset 4)
        ;; Tell Flycheck I write modern C++ and use src-relative includes
        (setq flycheck-clang-language-standard "c++17"
              flycheck-clang-include-path (list (concat (projectile-project-root) "src")))

        ;; Auto format C/C++ buffers
        (add-hook 'before-save-hook 'clang-format-buffer nil t))

      (add-hook 'c++-mode-hook 'chasinglogic-cpp-mode-hook)
      (add-hook 'c-mode-hook 'chasinglogic-cpp-mode-hook)
      (add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
    #+END_SRC

*** Rust

    Rust is my go to programming language outside of work. It has
    excellent Emacs support but most of the features I need are
    actually provided by LSP mode. This simply installs and attaches
    the Rust major mode to =.rs= files, enables format on save, and
    sets a better default compile command. Finally it loads =lsp= on
    =rust-mode= startup.

    #+BEGIN_SRC emacs-lisp
      (use-package rust-mode
        :mode ("\\.rs\\'")
        :config
        (setq rust-format-on-save t)
        (defun chasinglogic-rust-mode-hook ()
          (setq-local compile-command "cargo clippy && cargo test"))
        (add-hook 'rust-mode-hook 'chasinglogic-rust-mode-hook)
        (add-hook 'rust-mode-hook #'lsp))
    #+END_SRC

*** Miscellaneous Major Modes

    This is a list of major modes that I occasionally need and so are
    useful to have installed but I do not configure them as I do not
    write in these languages often or extensively.

    - Powershell
    - Groovy
    - YAML
    - TOML
    - CMake

    The following snippet just installs and attaches these modes to
    file extensions.

    #+BEGIN_SRC emacs-lisp
      (use-package vala-mode :mode ("\\.vala\\'"))
      (use-package meson-mode :mode ("meson\\.build"))
      (use-package powershell :mode ("\\.ps1\\'"))
      (use-package groovy-mode :mode ("\\.groovy$" "\\.gradle$"))
      (use-package yaml-mode :mode ("\\.yaml\\'" "\\.yml\\'" "\\.idl\\'"))
      (use-package toml-mode :mode ("\\gitconfig\\'" "\\.toml\\'"))
      (use-package cmake-mode :mode ("\\CMake.*txt\\'"))
    #+END_SRC

** Post initialization

   These are the few final steps we should take when bringing up
   Emacs.

   First Maximize this frame, the initial frame won't see our hooks in
   =make-frame-init-functions=.

   #+BEGIN_SRC emacs-lisp
     (maximize-gui-frames (selected-frame))
   #+END_SRC

   Finally start the Emacs server, this allows connecting terminal and
   other Emacs clients to this GUI editing session for easy sharing of
   information.

   #+BEGIN_SRC emacs-lisp
     (require 'server)
     (unless (server-running-p)
       (server-start))
   #+END_SRC

* Notes

  These are some notes that I keep to reference for certain parts of
  my dotfiles. Emacs is a large and sometimes strange beast so I need
  these notes to remember syntax or reasons for some changes that
  didn't make sense to document next to the setting since these notes
  are referenced in multiple places or are generally useful outside of
  just configuring Emacs.

** Emacs Regular Expressions

   For some reason Emacs doesn't use PCRE or even GNU regular
   expressions (like those in =grep= or =sed=). It uses it's own
   special remix of GNU regular expressions. The following is a list
   of gotchas or things that I always fail to remember when dealing
   with Emacs Regular Expressions.

   - Capture groups are not the default. =(= and =)= are treated as
     characters first and have to be escaped to be treated as a
     capture group.
   - Similar to capture groups ={= and =}= for repetition must be escaped.
   - There is no negation or =?= prefix operator
   - There is however a =?= postfix operator that works as expected on
     characters but on other postfix operators it makes it a
     non-greedy variant. For example: The normal operators ‘*’, ‘+’,
     ‘?’ match as much as they can, as long as the overall regexp can
     still match. With a following ‘?’, they will match as little as
     possible.
   - Character sets support character class specifiers. See
     [[info:elisp#Character Classes][Character Classes]] for a list.
   - Backslash supports Emacs specific semantic classes such as
     =\sCODE=. See [[info:elisp#Regexp Backslash][Regexp Backslash]] for a list.
   - Similar to Vim substitutions Emacs replace regexp can replace
     with subsets of the matched text. The syntax supports these
     forms:
     - =\&=: entire text that matched
     - =\N=: where N is a digit, replace with the Nth subexpression in
       the regular expression.
     - There are others but these are the only two I ever use. See
       [[info:elisp#Replacing Match][Replacing Match]] for the full documentation.

